<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x672C;&amp;#x5468;&amp;#x4E0E;Android&amp;#x754C;&amp;#x6709;&amp;#x5173;&amp;#x7684;&amp;#x5927;&amp;#x4E8B;&amp;#x771F;&amp;#x662F;&amp;#x4E0D;&amp;#x5C11;&amp;#x5440;!
Android Studio 2.2&amp;#x53D1;&amp;#x5E03;&amp;#xFF0C;&amp;#x5E26;&amp;#x6765;&amp;#x4E86;&amp;#x5F88;&amp;#x59">
<meta property="og:type" content="article">
<meta property="og:title" content="微信小程序之我见(本篇纯属扯淡，可以不看)">
<meta property="og:url" content="https://chacojack.github.io/2016/09/23/微信小程序之我见-本篇纯属扯淡，可以不看/index.html">
<meta property="og:site_name" content="ZejianChai's Note">
<meta property="og:description" content="&amp;#x672C;&amp;#x5468;&amp;#x4E0E;Android&amp;#x754C;&amp;#x6709;&amp;#x5173;&amp;#x7684;&amp;#x5927;&amp;#x4E8B;&amp;#x771F;&amp;#x662F;&amp;#x4E0D;&amp;#x5C11;&amp;#x5440;!
Android Studio 2.2&amp;#x53D1;&amp;#x5E03;&amp;#xFF0C;&amp;#x5E26;&amp;#x6765;&amp;#x4E86;&amp;#x5F88;&amp;#x59">
<meta property="og:updated_time" content="2016-09-23T15:25:06.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="微信小程序之我见(本篇纯属扯淡，可以不看)">
<meta name="twitter:description" content="&amp;#x672C;&amp;#x5468;&amp;#x4E0E;Android&amp;#x754C;&amp;#x6709;&amp;#x5173;&amp;#x7684;&amp;#x5927;&amp;#x4E8B;&amp;#x771F;&amp;#x662F;&amp;#x4E0D;&amp;#x5C11;&amp;#x5440;!
Android Studio 2.2&amp;#x53D1;&amp;#x5E03;&amp;#xFF0C;&amp;#x5E26;&amp;#x6765;&amp;#x4E86;&amp;#x5F88;&amp;#x59">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"hide"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="https://chacojack.github.io/2016/09/23/微信小程序之我见-本篇纯属扯淡，可以不看/"/>

  <title> 微信小程序之我见(本篇纯属扯淡，可以不看) | ZejianChai's Note </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">ZejianChai's Note</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">Android开发者</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="#" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup">
 <span class="search-icon fa fa-search"></span>
 <input type="text" id="local-search-input">
 <div id="local-search-result"></div>
 <span class="popup-btn-close">close</span>
</div>


    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                微信小程序之我见(本篇纯属扯淡，可以不看)
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-09-23T20:38:51+08:00" content="2016-09-23">
              2016-09-23
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/∆/" itemprop="url" rel="index">
                    <span itemprop="name">∆</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/09/23/微信小程序之我见-本篇纯属扯淡，可以不看/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/09/23/微信小程序之我见-本篇纯属扯淡，可以不看/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          
             <span id="/2016/09/23/微信小程序之我见-本篇纯属扯淡，可以不看/" class="leancloud_visitors" data-flag-title="微信小程序之我见(本篇纯属扯淡，可以不看)">
               &nbsp; | &nbsp;
               <span class="post-meta-item-icon">
                 <i class="fa fa-eye"></i>
               </span>
               <span class="post-meta-item-text">阅读次数 </span>
               <span class="leancloud-visitors-count"></span>
              </span>
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x672C;&#x5468;&#x4E0E;Android&#x754C;&#x6709;&#x5173;&#x7684;&#x5927;&#x4E8B;&#x771F;&#x662F;&#x4E0D;&#x5C11;&#x5440;!</p>
<p>Android Studio 2.2&#x53D1;&#x5E03;&#xFF0C;&#x5E26;&#x6765;&#x4E86;&#x5F88;&#x591A;&#x65B0;&#x7684;&#x597D;&#x7528;&#x7684;&#x7279;&#x6027;&#x3002;&#x65B0;&#x7684;&#x5E03;&#x5C40;&#x7F16;&#x8F91;&#x5668;&#x4EE5;&#x53CA;&#x4E0E;&#x4E4B;&#x914D;&#x5408;&#x7684;ConstraintLayout&#x5F3A;&#x5927;&#x7684;&#x771F;&#x662F;&#x8BBE;&#x8BA1;&#x5E08;&#x90FD;&#x53EF;&#x4EE5;&#x6765;&#x5E2E;&#x6211;&#x4EEC;&#x5199;UI&#x4E86;&#x3002;&#x8FD8;&#x6709;&#x5347;&#x7EA7;&#x7684;Instant Run&#x4E0E;build cache&#xFF0C;&#x52A0;&#x5FEB;&#x4E86;&#x7F16;&#x8BD1;&#x901F;&#x5EA6;&#x3002;&#x6700;&#x60CA;&#x559C;&#x7684;&#x662F;&#x6700;&#x86CB;&#x75BC;&#x7684;&#x53EA;&#x80FD;24API&#x624D;&#x80FD;&#x7528;&#x7684;Java8&#xFF0C;&#x8FD8;&#x4EE5;&#x4E3A;&#x7EC8;&#x4E8E;&#x53EF;&#x4EE5;&#x7545;&#x5FEB;&#x6DCB;&#x6F13;&#x7684;&#x4F7F;&#x7528;lambda&#x8868;&#x8FBE;&#x5F0F;&#x4E86;&#x3002;Google&#x4F60;TM&#x5728;&#x9017;&#x6211;!&#x4F60;TM&#x7ED9;&#x6211;&#x7FFB;&#x8BD1;&#x7FFB;&#x8BD1;&#x4EC0;&#x4E48;&#x53EB;TM&#x7684;&#x60CA;&#x559C;!&#x4E0D;&#x8FC7;&#x65B0;&#x63A8;&#x51FA;&#x7684;Find Sample Code&#x6211;&#x89C9;&#x7684;&#x8FD8;&#x662F;&#x5F88;&#x826F;&#x5FC3;&#x3002;&#x5BF9;&#x6211;&#x4EEC;&#x8FD9;&#x79CD;&#x4EE3;&#x7801;&#x7684;&#x642C;&#x8FD0;&#x5DE5;&#x771F;&#x7684;&#x662F;&#x518D;&#x5408;&#x9002;&#x4E0D;&#x8FC7;&#x4E86;&#x3002;&#x54C8;&#x54C8;!</p>
<p>&#x201C;&#x5E7A;&#x5E7A;&#x96F6;&#x5417;&#xFF1F;&#x4E0A;&#x4E00;&#x6BB5;&#x5185;&#x5BB9;&#xFF0C;&#x6587;&#x9898;&#x4E0D;&#x7B26;&#xFF0C;&#x6211;&#x8981;&#x62A5;&#x8B66;!&#x201D;</p>
<p>&#x201C;&#x4F60;&#x597D;!&#x8FD9;&#x91CC;&#x662F;&#x5E7A;&#x5E7A;&#x96F6;!&#x6B64;&#x4EBA;&#x592A;&#x5E05;&#xFF0C;&#x6211;&#x4EEC;&#x7BA1;&#x4E0D;&#x4E86;!&#x201D;</p>
<a id="more"></a>
<p>&#x826F;&#x5FC3;&#x8D31;&#xFF0C;&#x5965;&#x4E0D;&#x5BF9;&#xFF0C;&#x826F;&#x5FC3;&#x5EFA;&#x3002;&#x6765;&#x8BF4;&#x6B63;&#x4E8B;&#x4E86;&#x3002;&#x5728;&#x6211;&#x9AD8;&#x5174;&#x8FD8;&#x6CA1;&#x6709;&#x4E00;&#x5929;&#xFF0C;TMD(&#x6CE8;&#x610F;&#x6211;&#x52A0;&#x4E86;&#x4E2A;D)&#x5FAE;&#x4FE1;&#x5C31;&#x53D1;&#x4E86;&#x4E00;&#x4E2A;&#x53EB;&#x4EC0;&#x4E48;&#x5C0F;&#x7A0B;&#x5E8F;&#x7684;&#x4EC0;&#x4E48;&#x73A9;&#x610F;&#x3002;&#x8BF7;&#x82F9;&#x679C;&#x7ED9;&#x6211;&#x7FFB;&#x8BD1;&#x7FFB;&#x8BD1;&#x4EC0;&#x4E48;&#x53EB;&#x5C0F;&#x7A0B;&#x5E8F;&#xFF1F;&#x767E;&#x5EA6;&#x7FFB;&#x8BD1;&#xFF1A;Small program&#x3002;Google&#x7FFB;&#x8BD1;&#xFF1A;Applets&#x3002;&#x82F9;&#x679C;&#x7FFB;&#x8BD1;&#xFF1A;&#x7BA1;&#x6211;P&#x4E8B;!&#x901A;&#x8FC7;!(&#x5965;&#xFF0C;&#x4ECE;&#x76EE;&#x524D;&#x6765;&#x770B;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x5BA1;&#x6838;&#x901A;&#x8FC7;&#x4E86;!)</p>
<p>&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x4E00;&#x53D1;&#x5E03;&#xFF0C;&#x5927;&#x91CF;&#x7684;&#x516C;&#x53F8;&#x4E00;&#x5B9A;&#x8F6C;&#x53BB;&#x91CC;&#x9762;&#x5F00;&#x53D1;&#x5E94;&#x7528;&#x3002;&#x5C24;&#x5176;&#x662F;&#x521D;&#x521B;&#x7684;&#x516C;&#x53F8;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x8BF4;&#x5462;&#xFF1F;&#x6211;&#x4F30;&#x8BA1;&#x5927;&#x5BB6;&#x90FD;&#x6E05;&#x695A;&#x7684;&#x5F88;&#x3002;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x6709;&#x4EE5;&#x4E0B;&#x7684;&#x4F18;&#x52BF;&#xFF1A;</p>
<blockquote>
<p>-1- &#x65E0;&#x9700;&#x4E0B;&#x8F7D;&#xFF0C;&#x5B89;&#x88C5;&#xFF0C;&#x6CE8;&#x518C;</p>
</blockquote>
<p>&#x4F7F;&#x7528;&#x5C0F;&#x7A0B;&#x5E8F;&#x626B;&#x7801;&#x5373;&#x53EF;!&#x591A;&#x4E48;&#x7B26;&#x5408;&#x4E2D;&#x56FD;&#x4EBA;&#x7684;&#x4F7F;&#x7528;&#x4E60;&#x60EF;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x77E5;&#x9053;&#x6709;&#x591A;&#x5C11;&#x5E94;&#x7528;&#xFF0C;&#x5728;&#x5B89;&#x88C5;&#x6CE8;&#x518C;&#x7684;&#x73AF;&#x8282;&#x5C31;&#x5DF2;&#x7ECF;&#x5931;&#x53BB;&#x4E86;&#x5F88;&#x591A;&#x7528;&#x6237;&#x3002;&#x90A3;&#x4E48;&#x5728;&#x8FD9;&#x91CC;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#x7684;&#x5F97;&#x5230;&#x5E94;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x559C;&#x6B22;&#x4E5F;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x7684;&#x820D;&#x5F03;&#xFF0C;&#x65E0;&#x9700;&#x90A3;&#x70E6;&#x8E81;&#x7684;&#x5378;&#x8F7D;!&#x867D;&#x7136;&#x4E0D;&#x77E5;&#x9053;&#x5177;&#x4F53;&#x529F;&#x80FD;&#x4E0A;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x5C06;&#x4F1A;&#x975E;&#x5E38;&#x597D;!&#x81F3;&#x5C11;&#x8BA9;&#x6211;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x5B81;&#x613F;&#x5148;&#x626B;&#x4E2A;&#x7801;&#x8BD5;&#x8BD5;&#xFF0C;&#x4E0D;&#x597D;&#x7528;&#x76F4;&#x63A5;&#x6254;&#x4E86;&#xFF0C;&#x597D;&#x7528;&#x6536;&#x4E0B;&#x7559;&#x7740;&#x7528;&#x3002;&#x518D;&#x4E5F;&#x4E0D;&#x7528;&#x8BA9;&#x6211;&#x4E0B;&#x8F7D;&#x5B89;&#x88C5;&#x6CE8;&#x518C;&#x767B;&#x5F55;&#xFF0C;&#x5386;&#x7ECF;4&#x4E2A;&#x73AF;&#x8282;&#x7EC8;&#x4E8E;&#x53EF;&#x4EE5;&#x8BD5;&#x4E00;&#x8BD5;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x529F;&#x80FD;&#x4E0D;&#x6EE1;&#x610F;&#xFF0C;&#x53C8;&#x5378;&#x8F7D;&#x4E86;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x521D;&#x521B;&#x516C;&#x53F8;&#x8FDB;&#x884C;&#x8BD5;&#x6C34;&#xFF0C;&#x53EF;&#x8C13;&#x89E3;&#x51B3;&#x4E86;&#x4E00;&#x5927;&#x96BE;&#x9898;!</p>
<blockquote>
<p>-2- &#x65B0;&#x7684;&#x5929;&#x5730;</p>
</blockquote>
<p>&#x4E4B;&#x524D;App&#x65F6;&#x4EE3;&#xFF0C;&#x540E;&#x6765;&#x7684;&#x516C;&#x4F17;&#x53F7;&#xFF0C;&#x6BCF;&#x4E00;&#x6B21;&#x90FD;&#x6709;&#x4F1A;&#x6709;&#x4E00;&#x6279;&#x65B0;&#x7684;&#x5DE8;&#x5934;&#x51FA;&#x73B0;&#x3002;&#x800C;&#x4E14;&#x5728;&#x4E4B;&#x524D;&#x5904;&#x4E8E;&#x4F18;&#x52BF;&#x5730;&#x4F4D;&#x7684;&#x4E0D;&#x4E00;&#x5B9A;&#x5728;&#x65B0;&#x7684;&#x9886;&#x57DF;&#x4F9D;&#x7136;&#x72EC;&#x5360;&#x9CCC;&#x5934;&#x3002;&#x800C;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5929;&#x5730;&#xFF0C;&#x8FD9;&#x91CC;&#x5145;&#x6EE1;&#x7740;&#x65B0;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x800C;&#x4E14;&#x540C;&#x6837;&#x7684;&#xFF0C;&#x4E4B;&#x524D;&#x5904;&#x4E8E;&#x4F18;&#x52BF;&#x5730;&#x4F4D;&#x7684;&#x516C;&#x53F8;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x4F1A;&#x5728;&#x5C0F;&#x7A0B;&#x5E8F;&#x4E2D;&#x83B7;&#x5F97;&#x5F88;&#x597D;&#x7684;&#x6548;&#x679C;&#x3002;&#x8FD9;&#x91CC;&#x5145;&#x6EE1;&#x4E86;&#x673A;&#x4F1A;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x5C06;&#x662F;&#x5404;&#x5927;&#x516C;&#x53F8;&#x4E89;&#x593A;&#x4E4B;&#x5730;&#x3002;&#x800C;&#x8FD9;&#x5BF9;&#x4E8E;&#x521D;&#x521B;&#x516C;&#x53F8;&#x7684;&#x4EF7;&#x503C;&#x53EF;&#x754F;&#x662F;&#x975E;&#x5E38;&#x5927;&#x7684;!&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x673A;&#x4F1A;&#xFF0C;&#x8FD8;&#x6709;&#x4EC0;&#x4E48;&#x6BD4;&#x673A;&#x4F1A;&#x66F4;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x5417;&#xFF1F;&#x6709;&#xFF0C;&#x5E05;!&#x6211;&#x611F;&#x89C9;IT&#x754C;&#x7684;&#x6625;&#x5929;&#x8981;&#x6765;&#x4E86;&#x3002;</p>
<blockquote>
<p>-3- &#x7701;&#x94B1;</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x60F3;&#x4E00;&#x60F3;&#xFF0C;&#x4E4B;&#x524D;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#x8981;&#x60F3;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#xFF1F;Android&#x56E2;&#x961F;&#xFF0C;iOS&#x56E2;&#x961F;&#x3002;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x662F;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x5462;&#xFF1F;&#x4E00;&#x4E2A;&#x56E2;&#x961F;!&#x5C0F;&#x7A0B;&#x5E8F;&#x6709;&#x4E00;&#x7EDD;&#x5BF9;&#x7684;&#x4F18;&#x52BF;&#x5C31;&#x662F;&#x8DE8;&#x5E73;&#x53F0;&#xFF0C;&#x5F00;&#x53D1;&#x4E00;&#x5957;&#x7A0B;&#x5E8F;&#x591A;&#x5E73;&#x53F0;&#x4F7F;&#x7528;&#xFF0C;&#x751A;&#x81F3;&#xFF0C;&#x5FAE;&#x4FE1;&#x652F;&#x6301;&#x591A;&#x5C11;&#x4E2A;&#x5E73;&#x53F0;&#xFF0C;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x591A;&#x5C11;&#x4E2A;&#x5E73;&#x53F0;&#x4E0A;&#x8FD0;&#x884C;&#x3002;&#x8DE8;&#x5E73;&#x53F0;!&#x60F3;&#x60F3;&#x73B0;&#x5728;&#x90A3;&#x4E48;&#x706B;&#x7684;React Native&#x5427;!&#x867D;&#x7136;&#x5F00;&#x53D1;&#x4E2D;&#x7528;&#x7684;&#x5F88;&#x5C11;!&#x4F46;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x8DE8;&#x5E73;&#x53F0;&#x6027;&#xFF0C;&#x8BA9;&#x4ED6;&#x5728;&#x6280;&#x672F;&#x754C;&#x975E;&#x5E38;&#x706B;&#x3002;&#x53EA;&#x662F;&#x56E0;&#x4E3A;&#x6280;&#x672F;&#x8FD8;&#x4E0D;&#x6210;&#x719F;&#xFF0C;&#x8FD8;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x66FF;&#x4EE3;&#x539F;&#x751F;&#x5F00;&#x53D1;&#xFF0C;&#x6240;&#x4EE5;&#x5E76;&#x6CA1;&#x6709;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x3002;&#x4F46;&#x662F;&#x4ECE;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x7684;&#x7406;&#x5FF5;&#x4E2D;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x529F;&#x80FD;&#x8FD8;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x8FBE;&#x5230;&#x539F;&#x751F;&#x5F00;&#x53D1;&#x7684;&#x6C34;&#x5E73;&#x3002;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x529F;&#x80FD;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x6548;&#x679C;&#x65E0;&#x9700;&#x592A;&#x9AD8;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x8F6C;&#x5230;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x4E0A;&#x3002;&#x90A3;&#x4E48;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E9B;&#x516C;&#x53F8;&#x3002;&#x4ECE;&#x5F00;&#x53D1;&#x6210;&#x672C;&#x4E0A;&#x5BA2;&#x6237;&#x7AEF;&#x5DF2;&#x7ECF;&#x5C11;&#x4E86;&#x4E00;&#x534A;&#x4EBA;&#x529B;!&#x5927;&#x516C;&#x53F8;&#xFF0C;&#x8D22;&#x5927;&#x6C14;&#x7C97;&#x65E0;&#x6240;&#x8C13;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8FD9;&#x4E2A;IT&#x5BD2;&#x51AC;&#xFF0C;&#x771F;&#x662F;&#x7ED9;&#x4E86;&#x521D;&#x521B;&#x516C;&#x53F8;&#x4E00;&#x6839;&#x5F88;&#x7C97;&#x7684;&#x6551;&#x547D;&#x7684;&#x7A3B;&#x8349;&#x5440;!</p>
<p><em>&#x5176;&#x5B9E;&#x8FD8;&#x6709;&#x51E0;&#x70B9;&#x5185;&#x5BB9;&#xFF0C;&#x4F46;&#x662F;&#x53D1;&#x73B0;3&#x70B9;&#x6211;&#x5C31;&#x5199;&#x4E86;&#x633A;&#x591A;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x61D2;&#x7684;&#x5199;&#x4E86;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x4E09;&#x70B9;&#x5176;&#x5B9E;&#x5DF2;&#x7ECF;&#x5199;&#x5B8C;&#x4E86;&#x3002;&#x90A3;&#x4E48;&#x5F88;&#x591A;&#x4EBA;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x7136;&#x6211;&#x4E5F;&#x8FDB;&#x884C;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x8003;&#xFF1A;</em></p>
<blockquote>
<p>-4- &#x641E;Android&#xFF0C;iOS&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x9700;&#x4E0D;&#x9700;&#x8981;&#x62C5;&#x5FC3;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x5E26;&#x6765;&#x7684;&#x51B2;&#x51FB;&#x5462;&#xFF1F;</p>
</blockquote>
<p>&#x6211;&#x7684;&#x56DE;&#x7B54;&#x662F;&#xFF1A;&#x9700;&#x8981;&#x3002;&#x4ECE;&#x6211;&#x4E0A;&#x9762;&#x7684;&#x8BB2;&#x7684;&#x51E0;&#x70B9;&#x5185;&#x5BB9;&#x90FD;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#xFF0C;Android&#xFF0C;iOS&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x9700;&#x6C42;&#x80AF;&#x5B9A;&#x4F1A;&#x4E0B;&#x964D;&#x3002;&#x800C;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x6625;&#x5929;&#x8981;&#x6765;&#x4E86;&#x3002;Android&#xFF0C;iOS&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x80AF;&#x5B9A;&#x9700;&#x8981;&#x62C5;&#x5FC3;&#x5C0F;&#x7A0B;&#x5E8F;&#x5E26;&#x6765;&#x7684;&#x51B2;&#x51FB;&#x3002;&#x4E0D;&#x8FC7;IT&#x754C;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#x4E0D;&#x662F;&#x5417;&#xFF1F;&#x77AC;&#x606F;&#x4E07;&#x53D8;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x559C;&#x6B22;&#x7A33;&#x5B9A;&#xFF0C;&#x90A3;&#x4E48;&#x53BB;&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x5427;!&#x5176;&#x5B9E;&#x6211;&#x4E00;&#x76F4;&#x90FD;&#x89C9;&#x5F97;&#x5728;&#x641E;IT&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x5148;&#x60F3;&#x60F3;&#x81EA;&#x5DF1;&#x9002;&#x4E0D;&#x9002;&#x5408;&#xFF0C;&#x4E0D;&#x8981;&#x770B;&#x522B;&#x4EBA;&#x5DE5;&#x8D44;&#x9AD8;&#x5C31;&#x8FDB;&#x5165;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x3002;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x5206;&#x5206;&#x949F;&#x5931;&#x4E1A;!&#x6211;&#x8FD9;&#x4E2A;&#x4EBA;&#x6CA1;&#x4E8B;&#x559C;&#x6B22;&#x548C;&#x4EBA;&#x626F;&#x6DE1;&#xFF0C;&#x6211;&#x8BB0;&#x5F97;&#x81F3;&#x5C11;&#x6709;&#x4E09;&#x4E2A;&#x5F00;&#x6EF4;&#x6EF4;&#x7684;&#x53F8;&#x673A;&#xFF0C;&#x8C08;&#x81EA;&#x5DF1;&#x4E5F;&#x60F3;&#x641E;IT&#x3002;&#x4E0D;&#x8FC7;&#x6211;&#x6BCF;&#x6B21;&#x90FD;&#x5F88;&#x826F;&#x5FC3;&#x7684;&#x8BF4;&#xFF0C;&#x90A3;&#x4F60;&#x53BB;&#x8BD5;&#x8BD5;Python&#x5427;&#xFF0C;&#x90A3;&#x4E2A;&#x5F88;&#x597D;&#x5B66;&#x3002;&#x6709;&#x4E2A;&#x4EBA;&#x53F8;&#x673A;&#x5E08;&#x5085;&#x7ED9;&#x6211;&#x8BB2;&#xFF0C;&#x5B83;&#x7684;&#x670B;&#x53CB;&#x8BA9;&#x4ED6;&#x5148;&#x5B66;Linux&#x7CFB;&#x7EDF;&#x3002;&#x6211;&#x5FC3;&#x91CC;&#x4E00;&#x60F3;&#xFF0C;&#x4ED6;&#x771F;&#x662F;&#x4E2A;&#x597D;&#x670B;&#x53CB;&#x5440;!(&#x8FD9;&#x53E5;&#x8BDD;&#x6CA1;&#x6709;&#x53CD;&#x4E49;&#xFF0C;&#x6211;&#x662F;&#x771F;&#x7684;&#x89C9;&#x5F97;&#x4ED6;&#x7684;&#x670B;&#x53CB;&#x5F88;&#x597D;!)&#x4ED6;&#x7684;&#x670B;&#x53CB;&#x7528;&#x5F88;&#x5584;&#x610F;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5C06;&#x8FD9;&#x79CD;&#x4E0D;&#x5207;&#x5B9E;&#x9645;&#x7684;&#x60F3;&#x6CD5;&#x627C;&#x6740;&#x5728;&#x4E86;&#x6447;&#x7BEE;&#x5F53;&#x4E2D;&#x3002;&#x5176;&#x5B9E;IT&#x754C;&#x65F6;&#x65F6;&#x523B;&#x523B;&#x90FD;&#x5B58;&#x5728;&#x51B2;&#x51FB;&#x3002;&#x8FD9;&#x4E0D;&#x8FC7;&#x8FD9;&#x6B21;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#xFF0C;&#x5927;&#x4E00;&#x70B9;&#xFF0C;&#x76F4;&#x63A5;&#x4E00;&#x70B9;&#x3002;</p>
<blockquote>
<p>-5- &#x90A3;&#x4E48;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x662F;&#x5426;&#x4F1A;&#x66FF;&#x4EE3;&#x539F;&#x751F;APP&#xFF1F;</p>
</blockquote>
<p>&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x8C01;&#x53D1;&#x51FA;&#x7684;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x6211;&#x89C9;&#x5F97;&#xFF0C;&#x8FD9;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x5728;&#x626F;&#x6DE1;&#x3002;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x4E0D;&#x53EF;&#x80FD;&#x5B8C;&#x5168;&#x66FF;&#x4EE3;&#x539F;&#x751F;App&#x3002;&#x73B0;&#x5728;&#x975E;&#x5E38;&#x706B;&#x7684;React Native&#x5C1A;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x66FF;&#x4EE3;&#x539F;&#x751F;App&#xFF0C;&#x66F4;&#x4F55;&#x51B5;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#xFF0C;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x4F1A;&#x66FF;&#x4EE3;&#x4E00;&#x4E9B;&#x903B;&#x8F91;&#x529F;&#x80FD;&#x7B80;&#x5355;&#xFF0C;&#x6027;&#x80FD;&#x9700;&#x6C42;&#x4F4E;&#xFF0C;&#x6548;&#x679C;&#x8981;&#x6C42;&#x4E0D;&#x592A;&#x9AD8;&#x7684;App&#x3002;&#x4F46;&#x662F;&#x8981;&#x60F3;&#x8FBE;&#x5230;&#x4EE3;&#x66FF;&#x539F;&#x751F;App&#x7684;&#x6C34;&#x5E73;&#x8FD8;&#x6709;&#x5F85;&#x65F6;&#x65E5;&#x3002;&#x6240;&#x4EE5;&#x539F;&#x751F;App&#x8FD8;&#x662F;&#x6709;&#x4ED6;&#x7EDD;&#x5BF9;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x53EA;&#x4E0D;&#x8FC7;&#xFF0C;&#x4E0D;&#x4F1A;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x90FD;&#x4F1A;&#x6765;&#x5148;&#x505A;&#x4E00;&#x4E2A;App&#x4E86;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x5148;&#x505A;&#x4E2A;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x8BD5;&#x8BD5;&#x6C34;&#x3002;&#x4F46;&#x662F;&#x8BD5;&#x6C34;&#x6210;&#x529F;&#x4E86;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x516C;&#x53F8;&#x8FD8;&#x662F;&#x4F1A;&#x53BB;&#x505A;&#x81EA;&#x5DF1;&#x7684;&#x539F;&#x751F;App&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x8C01;&#x4F1A;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x547D;&#x4EA4;&#x4E2A;&#x5FAE;&#x4FE1;&#x5462;&#xFF1F;&#x6307;&#x4E0D;&#x5B9A;&#x5FAE;&#x4FE1;&#x770B;&#x4F60;&#x4E0D;&#x987A;&#x773C;&#xFF0C;&#x76F4;&#x63A5;&#x7ED9;&#x4F60;&#x5C01;&#x4E86;&#x3002;&#x4E4B;&#x524D;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#x8FD9;&#x79CD;&#x4F8B;&#x5B50;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x4E24;&#x4E2A;&#x5427;&#x3002;&#x6240;&#x4EE5;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x4F1A;&#x5BF9;&#x539F;&#x751F;App&#x9020;&#x6210;&#x51B2;&#x51FB;&#xFF0C;&#x4F46;&#x662F;&#x7EDD;&#x4E0D;&#x4F1A;&#x66FF;&#x4EE3;&#x539F;&#x751F;App&#x3002;</p>
<blockquote>
<p>-6- &#x9762;&#x4E34;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#x6211;&#x4EEC;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x8005;&#x8981;&#x600E;&#x4E48;&#x505A;&#xFF1F;</p>
</blockquote>
<p>&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x7684;&#x63A8;&#x51FA;&#xFF0C;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x90E8;&#x5206;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x5931;&#x4E1A;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x6709;&#x5B9E;&#x529B;&#x4E86;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x3002;&#x5DE5;&#x4F5C;&#x5E94;&#x8BE5;&#x8FD8;&#x662F;&#x6709;&#x7684;&#x3002;&#x800C;&#x4E14;&#x5BF9;&#x4E8E;&#x6B63;&#x5728;&#x627E;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x5C97;&#x4F4D;&#x7684;&#x4EBA;&#xFF0C;&#x5404;&#x4E2A;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x5C97;&#x4F4D;&#x7684;&#x5E94;&#x8058;&#x6C34;&#x5E73;&#x4E5F;&#x4F1A;&#x63D0;&#x5347;&#xFF0C;&#x81EA;&#x7136;&#x96BE;&#x5EA6;&#x4E5F;&#x4F1A;&#x589E;&#x52A0;&#x3002;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x7684;&#x6C34;&#x5E73;&#x662F;&#x5173;&#x952E;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#xFF0C;&#x4F60;&#x662F;&#x521A;&#x521A;&#x5B66;&#x4E60;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#xFF0C;&#x5982;&#x679C;&#x81EA;&#x5DF1;&#x662F;&#x975E;&#x5E38;&#x559C;&#x6B22;&#x79FB;&#x52A8;&#x5F00;&#x53D1;(&#x50CF;&#x6211;&#x4E00;&#x6837;)&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53BB;&#x6DF1;&#x5EA6;&#x94BB;&#x7814;&#xFF0C;&#x8FD9;&#x70B9;&#x6211;&#x505A;&#x7684;&#x8FD8;&#x4E0D;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x592A;&#x7231;&#x73A9;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x8FD8;&#x4E0D;&#x662F;&#x6709;&#x8FD9;&#x79CD;&#x5F3A;&#x70C8;&#x7684;&#x559C;&#x597D;&#x7684;&#x4EBA;&#xFF0C;&#x90A3;&#x4E48;&#x53BB;&#x5B66;&#x4E60;&#x5B66;&#x4E60;JS&#xFF0C;H5&#xFF0C;&#x7136;&#x540E;&#x518D;&#x505A;&#x6289;&#x62E9;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x4E0D;&#x9519;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<blockquote>
<p>-7- &#x90A3;&#x4E48;&#xFF0C;&#x6211;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x8BA1;&#x5212;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>
</blockquote>
<p>&#x9996;&#x5148;&#x6211;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x521D;&#x7EA7;Android&#x7A0B;&#x5E8F;&#x733F;&#x3002;&#x6211;&#x4E5F;&#x627F;&#x8BA4;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x7684;&#x63A8;&#x51FA;&#x8BA9;&#x6211;&#x5341;&#x5206;&#x62C5;&#x5FE7;&#x3002;&#x56E0;&#x4E3A;&#x81EA;&#x5DF1;&#x6B63;&#x662F;&#x8FD9;&#x79CD;&#x5B58;&#x6D3B;&#x5728;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x5E95;&#x5C42;&#x7684;&#x4EBA;&#x3002;&#x5982;&#x679C;&#x5931;&#x4E1A;&#xFF0C;&#x6211;&#x8FD9;&#x79CD;&#x4EBA;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x975E;&#x5E38;&#x5927;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4F9D;&#x7136;&#x4F1A;&#x6309;&#x7167;&#x81EA;&#x5DF1;&#x7684;&#x8BA1;&#x5212;&#xFF0C;&#x6309;&#x90E8;&#x5C31;&#x73ED;&#x7684;&#x5B66;&#x4E60;&#x3002;&#x800C;&#x4E14;&#x6211;&#x4F1A;&#x62BD;&#x51FA;&#x65F6;&#x95F4;&#xFF0C;&#x5927;&#x6982;&#x6BCF;&#x5468;&#x4E24;&#x5929;&#x7684;&#x4E1A;&#x4F59;&#x65F6;&#x95F4;&#x5B66;&#x4E60;JS&#xFF0C;&#x800C;&#x4E14;&#x5F88;&#x53EF;&#x80FD;&#x662F;&#x5468;&#x516D;&#x5468;&#x65E5;&#x3002;&#x65F6;&#x4EE3;&#x5728;&#x53D1;&#x5C55;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x65F6;&#x523B;&#x51C6;&#x5907;&#x7740;&#x3002;&#x770B;&#x770B;JS&#x7684;&#x53D1;&#x5C55;&#xFF0C;Node.js&#xFF0C;AngularJS&#xFF0C;React Native&#xFF0C;&#x5230;&#x73B0;&#x5728;&#x7684;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#xFF0C;JS&#x7684;&#x5F3A;&#x5927;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x4EBA;&#x80FD;&#x963B;&#x6321;&#x4E86;&#xFF0C;&#x518D;&#x770B;&#x770B;&#x4ECA;&#x5E74;github&#x5404;&#x4E2A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x53D1;&#x5C55;&#x60C5;&#x51B5;&#xFF0C;&#x7B2C;&#x4E00;&#x7684;&#x662F;JS&#xFF0C;&#x7B2C;&#x4E8C;&#x7684;&#x662F;Java&#x3002;&#x65E0;&#x8BBA;&#x4ECE;&#x90A3;&#x4E2A;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x518D;&#x4E0D;&#x5B66;&#x4E60;JS&#xFF0C;&#x771F;&#x7684;&#x5C31;&#x8981;&#x88AB;&#x65F6;&#x4EE3;&#x629B;&#x5F03;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x5728;&#x4E4B;&#x540E;&#x53EF;&#x80FD;&#x4E5F;&#x4F1A;&#x53D1;&#x4E00;&#x4E9B;&#x6709;&#x5173;JS&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x5E0C;&#x671B;&#x50CF;&#x6211;&#x4E00;&#x6837;&#x8FD8;&#x662F;&#x5C0F;&#x767D;&#x7684;&#x4EBA;&#xFF0C;&#x5927;&#x5BB6;&#x80FD;&#x4E00;&#x8D77;&#x5B66;&#x4E60;&#xFF0C;&#x4E00;&#x8D77;&#x8FDB;&#x6B65;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x5982;&#x679C;&#x771F;&#x7684;&#x662F;&#x559C;&#x6B22;Android&#x5F00;&#x53D1;&#xFF0C;&#x6216;&#x7740;iOS&#x5F00;&#x53D1;&#x7684;&#x4EBA;&#x4E5F;&#x4E0D;&#x8981;&#x653E;&#x5F03;&#xFF0C;&#x56E0;&#x4E3A;&#x95F9;&#x8FD9;&#x6837;&#x4E00;&#x51FA;&#xFF0C;&#x5927;&#x5BB6;&#x80AF;&#x5B9A;&#x90FD;&#x7EB7;&#x7EB7;&#x53BB;&#x5B66;&#x524D;&#x7AEF;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6574;&#x4F53;&#x6765;&#x8BB2;&#xFF0C;Android&#x5F00;&#x53D1;&#x548C;iOS&#x5F00;&#x53D1;&#x5C97;&#x4F4D;&#x5C11;&#x4E86;&#xFF0C;&#x8981;&#x6C42;&#x9AD8;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x7ADE;&#x4E89;&#x7684;&#x4EBA;&#x4E5F;&#x5C11;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x7ADE;&#x4E89;&#x7A0B;&#x5EA6;&#x5E94;&#x8BE5;&#x548C;&#x73B0;&#x5728;&#x76F8;&#x5DEE;&#x4E0D;&#x5927;&#x3002;&#x9075;&#x4ECE;&#x81EA;&#x5DF1;&#x7684;&#x5185;&#x5FC3;&#x3002;&#x4F60;&#x4E00;&#x5B9A;&#x8981;&#x52AA;&#x529B;&#xFF0C;&#x4F46;&#x5343;&#x4E07;&#x522B;&#x7740;&#x6025;&#x3002;</p>
<blockquote>
<p>-8- &#x626F;&#x5B8C;&#x6DE1;&#x4E86;&#xFF0C;&#x6700;&#x540E;&#x8BB2;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;</p>
</blockquote>
<p>&#x6211;&#x4E4B;&#x524D;&#x53D1;&#x7684;<a href="http://www.jianshu.com/p/6c78a5a07db5" target="_blank" rel="external">&#x628A;RecyclerView&#x64B8;&#x6210;&#x9A6C;&#x8702;&#x7A9D;</a>&#x7684;&#x6587;&#x7AE0;&#x6536;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x884C;&#x5185;&#x4EBA;&#x58EB;&#x7684;&#x5173;&#x6CE8;&#x3002;&#x6211;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x60F3;&#x5230;&#x4F1A;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x6210;&#x679C;&#x3002;&#x4E5F;&#x6709;&#x4EBA;&#x9080;&#x8BF7;&#x6211;&#x53BB;&#x4ED6;&#x4EEC;&#x7684;&#x8BBA;&#x575B;&#x6295;&#x7A3F;&#xFF0C;&#x81EA;&#x5DF1;&#x4E5F;&#x8FD9;&#x6837;&#x505A;&#x4E86;&#xFF0C;&#x6709;&#x4E1C;&#x897F;&#x5206;&#x4EAB;&#x7ED9;&#x5927;&#x5BB6;&#x81EA;&#x5DF1;&#x4E5F;&#x5F88;&#x6709;&#x6210;&#x5C31;&#x611F;&#xFF0C;&#x800C;&#x53D7;&#x5230;&#x9080;&#x8BF7;&#x771F;&#x7684;&#x5F88;&#x8363;&#x5E78;&#xFF0C;&#x975E;&#x5E38;&#x8C22;&#x8C22;&#x5404;&#x4F4D;&#x3002;&#x4E5F;&#x8C22;&#x8C22;&#x5404;&#x4F4D;&#x8BFB;&#x8005;&#x7684;&#x652F;&#x6301;&#x3002;&#x672C;&#x6765;&#x6211;&#x53EA;&#x662F;&#x50CF;&#x901A;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#x6559;&#x5927;&#x5BB6;&#x5982;&#x4F55;&#x81EA;&#x5B9A;&#x4E49;LayoutManager&#x3002;&#x4F46;&#x6CA1;&#x60F3;&#x5230;&#x5927;&#x5BB6;&#x4F1A;&#x8FD9;&#x4E48;&#x559C;&#x6B22;&#x8FD9;&#x4E2A;&#x6548;&#x679C;&#x3002;&#x5F88;&#x591A;&#x8BFB;&#x8005;&#x5E2E;&#x52A9;&#x6211;&#x627E;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;bug&#xFF0C;&#x6211;&#x975E;&#x5E38;&#x611F;&#x8C22;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x7684;&#x4E1A;&#x4F59;&#x65F6;&#x95F4;&#x5B89;&#x6392;&#x662F;&#x6309;&#x5468;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x6BCF;&#x5468;&#x90FD;&#x4F1A;&#x6709;&#x4E0D;&#x80FD;&#x6253;&#x65AD;&#x5177;&#x4F53;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x53CA;&#x65F6;&#x7684;&#x6539;&#x6B63;&#x5927;&#x5BB6;&#x63D0;&#x51FA;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x975E;&#x5E38;&#x62B1;&#x6B49;&#x3002;&#x5982;&#x679C;&#x60F3;&#x4E86;&#x89E3;&#x6211;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x53BB;&#x770B;&#x6211;&#x7684;&#x53E6;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;<a href="http://www.jianshu.com/p/76e3f9cfae5b" target="_blank" rel="external">&#x79BB;&#x5F00;&#x5B66;&#x6821;&#x7684;&#x6211;&#x5374;&#x66F4;&#x4F1A;&#x5B66;&#x4E60;&#x4E86;</a>&#x3002;&#x6211;&#x7B54;&#x5E94;&#x5927;&#x5BB6;&#xFF0C;&#x4E0B;&#x5468;&#x4F1A;&#x7EDF;&#x4E00;&#x89E3;&#x51B3;&#x4F60;&#x4EEC;&#x63D0;&#x51FA;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x662F;&#x4E00;&#x5B9A;&#x4F1A;&#x505A;&#x5230;&#x7684;&#x3002;&#x800C;&#x4E14;&#x6211;&#x8FD8;&#x4F1A;&#x5B8C;&#x5584;&#x5B83;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5E76;&#x7ED9;&#x51FA;&#x51E0;&#x4E2A;&#x5B83;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;&#xFF0C;&#x5E76;&#x5C01;&#x88C5;&#x6210;&#x5E93;&#xFF0C;&#x65B9;&#x4FBF;&#x5927;&#x5BB6;&#x4F7F;&#x7528;&#x548C;&#x5B66;&#x4E60;&#x3002;&#x5E0C;&#x671B;&#x5230;&#x65F6;&#x5019;&#x5404;&#x4F4D;&#x591A;&#x4E3A;&#x6211;&#x63D0;&#x4E9B;&#x610F;&#x89C1;&#x548C;&#x5EFA;&#x8BAE;&#x3002;</p>
<blockquote>
<p>-9- &#x9644;&#x52A0;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;</p>
</blockquote>
<p>&#x5176;&#x5B9E;&#x672C;&#x5468;&#x6211;&#x4E5F;&#x6CA1;&#x6709;&#x95F2;&#x7740;&#x3002;&#x672C;&#x5468;&#x6211;&#x4E3B;&#x8981;&#x89E3;&#x51B3;&#x4E4B;&#x524D;&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;&#x9057;&#x7559;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x5B66;&#x4E60;Android Studio 2.2 &#x7684;&#x65B0;&#x7279;&#x6027;&#xFF0C;&#x51E0;&#x4E4E;&#x9664;&#x4E86;firebase&#x90FD;&#x8BD5;&#x4E86;&#x4E00;&#x904D;&#xFF0C;&#x4E0D;&#x8FC7;&#x770B;&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x7684;&#x6587;&#x7AE0;&#x7F51;&#x4E0A;&#x5DF2;&#x7ECF;&#x5F88;&#x591A;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x5927;&#x540C;&#x5C0F;&#x5F02;&#xFF0C;&#x6211;&#x5C31;&#x4E0D;&#x53BB;&#x51D1;&#x70ED;&#x95F9;&#x4E86;&#x3002;&#x9664;&#x4E86;&#x4E0A;&#x9762;&#x8FD9;&#x4E9B;&#xFF0C;&#x6211;&#x8FD8;&#x5728;&#x770B;<a href="http://www.jianshu.com/users/dfc0ed52c22b/latest_articles" target="_blank" rel="external">&#x5F90;&#x5B9C;&#x751F;</a>&#x5927;&#x795E;&#x5199;&#x7684;&#x65B0;&#x4E66;<strong>Android&#x7FA4;&#x82F1;&#x4F20;&#xFF1A;&#x795E;&#x5175;&#x5229;&#x5668;</strong>&#x3002;&#x8FD9;&#x672C;&#x4E66;&#x5199;&#x7684;&#x5F88;&#x597D;&#x3002;&#x6211;&#x4EE5;&#x524D;&#x5047;&#x88C5;&#x4F1A;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x771F;&#x7684;&#x4F1A;&#x7528;&#x4E86;&#x3002;&#x4E0D;&#x8FC7;&#x6211;&#x8FD8;&#x6CA1;&#x6709;&#x770B;&#x591A;&#x5C11;&#x3002;&#x8FD9;&#x4E2A;&#x8981;&#x8FB9;&#x770B;&#x8FB9;&#x5B9E;&#x9645;&#x64CD;&#x4F5C;&#xFF0C;&#x5176;&#x5B9E;&#x8981;&#x60F3;&#x638C;&#x63E1;&#x7EDD;&#x975E;&#x770B;&#x770B;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#x3002;&#x6211;&#x4E5F;&#x53D7;&#x5F90;&#x5B9C;&#x751F;&#x5927;&#x795E;&#x672C;&#x4EBA;&#x4E4B;&#x6258;&#x548C;&#x51ED;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x826F;&#x5FC3;&#xFF0C;&#x4E3A;&#x5173;&#x6CE8;&#x6211;&#x7684;&#x4E3A;&#x6570;&#x4E0D;&#x591A;&#x7684;&#x8BFB;&#x8005;&#x4EEC;&#x63A8;&#x8350;&#x8FD9;&#x672C;&#x4E66;&#x3002;&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x548C;&#x6211;&#x4E00;&#x540C;&#x8FDB;&#x6B65;&#x3002;</p>
<p>&#x55EF;&#xFF0C;&#x540E;&#x9762;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x4EBA;&#x751F;&#x7406;&#x60F3;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x7684;&#x7406;&#x60F3;&#x662F;&#xFF0C;&#x4E0D;&#x7528;&#x4E0A;&#x73ED;&#x8FD8;&#x6709;&#x94B1;!</p>
<p>&#x626F;&#x4E86;&#x534A;&#x5929;&#x6DE1;&#xFF0C;&#x975E;&#x5E38;&#x611F;&#x8C22;&#x613F;&#x610F;&#x770B;&#x6211;&#x626F;&#x6DE1;&#x7684;&#x4F60;&#x3002;&#x5982;&#x679C;&#x60F3;&#x9A82;&#x6211;&#xFF0C;&#x54C8;&#x54C8;&#xFF0C;&#x9898;&#x76EE;&#x5C31;&#x5DF2;&#x7ECF;&#x544A;&#x8BC9;&#x4F60;&#x4E86;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x4E00;&#x7BC7;&#x5E72;&#x8D27;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x5173;&#x6211;&#x4E8B;&#x4E86;&#x3002;&#x4E0B;&#x5468;&#x89C1;!</p>

      
    </div>

    <div>
      
        
      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/09/14/把RecyclerView做成-马-蜂-窝/" rel="next" title="把RecyclerView撸成 马 蜂 窝(自定义LayoutManager)">
                <i class="fa fa-chevron-left"></i> 把RecyclerView撸成 马 蜂 窝(自定义LayoutManager)
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/09/25/教你把Java-Bean撸成串的最快方法/" rel="prev" title="教你把Java Bean撸成串的最快方法">
                教你把Java Bean撸成串的最快方法 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/09/23/微信小程序之我见-本篇纯属扯淡，可以不看/"
           data-title="微信小程序之我见(本篇纯属扯淡，可以不看)" data-url="https://chacojack.github.io/2016/09/23/微信小程序之我见-本篇纯属扯淡，可以不看/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.png"
               alt="柴泽建" />
          <p class="site-author-name" itemprop="name">柴泽建</p>
          <p class="site-description motion-element" itemprop="description">对代码永不满足</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">22</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              
                <span class="site-state-item-count">1</span>
                <span class="site-state-item-name">标签</span>
              
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/Chacojack" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/2703310877" target="_blank" title="Weibo">
                  
                    <i class="fa fa-fw fa-weibo"></i>
                  
                  Weibo
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.jianshu.com/users/dd5f6394457d/latest_articles" target="_blank" title="Jianshu">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  Jianshu
                </a>
              </span>
            
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">柴泽建</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"jack-chai-notes"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  






  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
       search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();

    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
    'use strict';
    $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
            // get the contents from search data
            isfetched = true;
            $('.popup').detach().appendTo('.header-inner');
            var datas = $( "entry", xmlResponse ).map(function() {
                return {
                    title: $( "title", this ).text(),
                    content: $("content",this).text(),
                    url: $( "url" , this).text()
                };
            }).get();
            var $input = document.getElementById(search_id);
            var $resultContent = document.getElementById(content_id);
            $input.addEventListener('input', function(){
                var matchcounts = 0;
                var str='<ul class=\"search-result-list\">';                
                var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
                $resultContent.innerHTML = "";
                if (this.value.trim().length > 1) {
                // perform local searching
                datas.forEach(function(data) {
                    var isMatch = true;
                    var content_index = [];
                    var data_title = data.title.trim().toLowerCase();
                    var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                    var data_url = data.url;
                    var index_title = -1;
                    var index_content = -1;
                    var first_occur = -1;
                    // only match artiles with not empty titles and contents
                    if(data_title != '' && data_content != '') {
                        keywords.forEach(function(keyword, i) {
                            index_title = data_title.indexOf(keyword);
                            index_content = data_content.indexOf(keyword);
                            if( index_title < 0 && index_content < 0 ){
                                isMatch = false;
                            } else {
                                if (index_content < 0) {
                                    index_content = 0;
                                }
                                if (i == 0) {
                                    first_occur = index_content;
                                }
                            }
                        });
                    }
                    // show search results
                    if (isMatch) {
                        matchcounts += 1;
                        str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                        var content = data.content.trim().replace(/<[^>]+>/g,"");
                        if (first_occur >= 0) {
                            // cut out 100 characters
                            var start = first_occur - 20;
                            var end = first_occur + 80;
                            if(start < 0){
                                start = 0;
                            }
                            if(start == 0){
                                end = 50;
                            }
                            if(end > content.length){
                                end = content.length;
                            }
                            var match_content = content.substring(start, end);
                            // highlight all keywords
                            keywords.forEach(function(keyword){
                                var regS = new RegExp(keyword, "gi");
                                match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                            });
                            
                            str += "<p class=\"search-result\">" + match_content +"...</p>"
                        }
                        str += "</li>";
                    }
                })};
                str += "</ul>";
                if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
                if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
                $resultContent.innerHTML = str;
            });
            proceedsearch();
        }
    });}

    // handle and trigger popup window;
    $('.popup-trigger').mousedown(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };

    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>

  

  

  
  <script src="https://cdn1.lncld.net/static/js/av-core-mini-0.6.1.js"></script>
  <script>AV.initialize("Lsvcc0AtrLqT6Pw3Cr7f8phj-gzGzoHsz", "HvTbRI5ugVcWRpBIMaPXB6XX");</script>
  <script>
    function showTime(Counter) {
      var query = new AV.Query(Counter);
      var entries = [];
      var $visitors = $(".leancloud_visitors");

      $visitors.each(function () {
        entries.push( $(this).attr("id").trim() );
      });

      query.containedIn('url', entries);
      query.find()
        .done(function (results) {
          var COUNT_CONTAINER_REF = '.leancloud-visitors-count';

          if (results.length === 0) {
            $visitors.find(COUNT_CONTAINER_REF).text(0);
            return;
          }

          for (var i = 0; i < results.length; i++) {
            var item = results[i];
            var url = item.get('url');
            var time = item.get('time');
            var element = document.getElementById(url);

            $(element).find(COUNT_CONTAINER_REF).text(time);
          }
          for(var i = 0; i < entries.length; i++) {
            var url = entries[i];
            var element = document.getElementById(url);
            var countSpan = $(element).find(COUNT_CONTAINER_REF);
            if( countSpan.text() == '') {
              countSpan.text(0);
            }
          }
        })
        .fail(function (object, error) {
          console.log("Error: " + error.code + " " + error.message);
        });
    }

    function addCount(Counter) {
      var $visitors = $(".leancloud_visitors");
      var url = $visitors.attr('id').trim();
      var title = $visitors.attr('data-flag-title').trim();
      var query = new AV.Query(Counter);

      query.equalTo("url", url);
      query.find({
        success: function(results) {
          if (results.length > 0) {
            var counter = results[0];
            counter.fetchWhenSave(true);
            counter.increment("time");
            counter.save(null, {
              success: function(counter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(counter.get('time'));
              },
              error: function(counter, error) {
                console.log('Failed to save Visitor num, with error message: ' + error.message);
              }
            });
          } else {
            var newcounter = new Counter();
            /* Set ACL */
            var acl = new AV.ACL();
            acl.setPublicReadAccess(true);
            acl.setPublicWriteAccess(true);
            newcounter.setACL(acl);
            /* End Set ACL */
            newcounter.set("title", title);
            newcounter.set("url", url);
            newcounter.set("time", 1);
            newcounter.save(null, {
              success: function(newcounter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(newcounter.get('time'));
              },
              error: function(newcounter, error) {
                console.log('Failed to create');
              }
            });
          }
        },
        error: function(error) {
          console.log('Error:' + error.code + " " + error.message);
        }
      });
    }

    $(function() {
      var Counter = AV.Object.extend("Counter");
      if ($('.leancloud_visitors').length == 1) {
        addCount(Counter);
      } else if ($('.post-title-link').length > 1) {
        showTime(Counter);
      }
    });
  </script>



  

</body>
</html>
