<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x9605;&amp;#x8BFB;&amp;#x672C;&amp;#x6587;&amp;#x4F60;&amp;#x53EF;&amp;#x80FD;&amp;#x9700;&amp;#x8981;1.5&amp;#x5206;&amp;#x949F;&amp;#xFF0C;&amp;#x4E5F;&amp;#x53EF;&amp;#x80FD;&amp;#x9700;&amp;#x8981;15&amp;#x5206;&amp;#x949F;&amp;#x3002;

&amp;#x79BB;&amp;#x5F00;&amp;#x5B66;&amp;#x751F;">
<meta property="og:type" content="article">
<meta property="og:title" content="离开学校的我却更会学习了">
<meta property="og:url" content="https://chacojack.github.io/2016/09/10/离开学校的我却更会学习了/index.html">
<meta property="og:site_name" content="ZejianChai's Note">
<meta property="og:description" content="&amp;#x9605;&amp;#x8BFB;&amp;#x672C;&amp;#x6587;&amp;#x4F60;&amp;#x53EF;&amp;#x80FD;&amp;#x9700;&amp;#x8981;1.5&amp;#x5206;&amp;#x949F;&amp;#xFF0C;&amp;#x4E5F;&amp;#x53EF;&amp;#x80FD;&amp;#x9700;&amp;#x8981;15&amp;#x5206;&amp;#x949F;&amp;#x3002;

&amp;#x79BB;&amp;#x5F00;&amp;#x5B66;&amp;#x751F;">
<meta property="og:image" content="http://upload-images.jianshu.io/upload_images/2096079-cef3e9ef7a7f2f55.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240">
<meta property="og:image" content="http://upload-images.jianshu.io/upload_images/2096079-3214365da373ba92.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240">
<meta property="og:updated_time" content="2016-09-10T19:03:40.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="离开学校的我却更会学习了">
<meta name="twitter:description" content="&amp;#x9605;&amp;#x8BFB;&amp;#x672C;&amp;#x6587;&amp;#x4F60;&amp;#x53EF;&amp;#x80FD;&amp;#x9700;&amp;#x8981;1.5&amp;#x5206;&amp;#x949F;&amp;#xFF0C;&amp;#x4E5F;&amp;#x53EF;&amp;#x80FD;&amp;#x9700;&amp;#x8981;15&amp;#x5206;&amp;#x949F;&amp;#x3002;

&amp;#x79BB;&amp;#x5F00;&amp;#x5B66;&amp;#x751F;">
<meta name="twitter:image" content="http://upload-images.jianshu.io/upload_images/2096079-cef3e9ef7a7f2f55.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"hide"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="https://chacojack.github.io/2016/09/10/离开学校的我却更会学习了/"/>

  <title> 离开学校的我却更会学习了 | ZejianChai's Note </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">ZejianChai's Note</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">Android开发者</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="#" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup">
 <span class="search-icon fa fa-search"></span>
 <input type="text" id="local-search-input">
 <div id="local-search-result"></div>
 <span class="popup-btn-close">close</span>
</div>


    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                离开学校的我却更会学习了
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-09-10T22:48:56+08:00" content="2016-09-10">
              2016-09-10
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/∆/" itemprop="url" rel="index">
                    <span itemprop="name">∆</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/09/10/离开学校的我却更会学习了/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/09/10/离开学校的我却更会学习了/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          
             <span id="/2016/09/10/离开学校的我却更会学习了/" class="leancloud_visitors" data-flag-title="离开学校的我却更会学习了">
               &nbsp; | &nbsp;
               <span class="post-meta-item-icon">
                 <i class="fa fa-eye"></i>
               </span>
               <span class="post-meta-item-text">阅读次数 </span>
               <span class="leancloud-visitors-count"></span>
              </span>
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <blockquote>
<p>&#x9605;&#x8BFB;&#x672C;&#x6587;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;1.5&#x5206;&#x949F;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x9700;&#x8981;15&#x5206;&#x949F;&#x3002;</p>
</blockquote>
<p>&#x79BB;&#x5F00;&#x5B66;&#x751F;&#x751F;&#x6DAF;&#x5927;&#x6982;2&#x4E2A;&#x6708;&#x4E86;&#xFF0C;&#x6211;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x66F4;&#x4F1A;&#x5B66;&#x4E60;&#x4E86;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#x60F3;&#x60F3;&#xFF0C;&#x5728;&#x81EA;&#x5DF1;&#x8FD8;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x6210;&#x529F;&#x4E8B;&#x8FF9;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8BB2;&#x8FD9;&#x79CD;&#x4E1C;&#x897F;&#x4E5F;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5BA2;&#x89C2;&#x8BF4;&#x670D;&#x529B;&#x3002;&#x4F46;&#x6211;&#x5DF2;&#x7ECF;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x8D8A;&#x6765;&#x8D8A;&#x597D;&#x4E86;&#x3002;&#x90A3;&#x4E48;&#x4E0B;&#x9762;&#x5206;&#x4EAB;&#x4E00;&#x4E0B;&#x6211;&#x662F;&#x600E;&#x4E48;&#x505A;&#x7684;&#x3002;</p>
<h1 id="&#x5206;&#x6790;&#x81EA;&#x8EAB;&#x7279;&#x70B9;"><a href="#&#x5206;&#x6790;&#x81EA;&#x8EAB;&#x7279;&#x70B9;" class="headerlink" title="&#x5206;&#x6790;&#x81EA;&#x8EAB;&#x7279;&#x70B9;"></a>&#x5206;&#x6790;&#x81EA;&#x8EAB;&#x7279;&#x70B9;</h1><p>&#x6CA1;&#x6709;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4E07;&#x80FD;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x5BF9;&#x81EA;&#x8EAB;&#x7684;&#x7279;&#x70B9;&#x8FDB;&#x884C;&#x5206;&#x6790;&#xFF0C;&#x7136;&#x540E;&#x91CF;&#x8EAB;&#x6253;&#x9020;&#x3002;&#x90A3;&#x4E48;&#x6211;&#x7684;&#x7279;&#x70B9;&#x662F;&#xFF1A;</p>
<ol>
<li>&#x6211;&#x957F;&#x7684;&#x4E0D;&#x5E05;</li>
<li>&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;</li>
<li>&#x6211;&#x6CA1;&#x6709;&#x5973;&#x670B;&#x53CB;</li>
</ol>
<a id="more"></a>
<p>&#x90A3;&#x4E48;&#x597D;&#xFF0C;&#x6DF1;&#x5165;&#x5206;&#x6790;&#x4E00;&#x4E0B;&#x6211;&#x7684;&#x7279;&#x70B9;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x70B9;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x4E0D;&#x627F;&#x8BA4;&#x6211;&#x957F;&#x7684;&#x4E11;&#xFF0C;&#x4F46;&#x6211;&#x627F;&#x8BA4;&#x6211;&#x786E;&#x5B9E;&#x957F;&#x7684;&#x4E0D;&#x5E05;&#x3002;&#x8FD9;&#x5C31;&#x5BFC;&#x81F4;&#x6211;&#x4E0D;&#x80FD;&#x9760;&#x8138;&#x5403;&#x996D;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x8C01;&#x4E0D;&#x613F;&#x610F;&#x5462;&#xFF1F;</p>
<p>&#x7B2C;&#x4E8C;&#x70B9;&#xFF0C;&#x6211;&#x662F;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x3002;&#x5BF9;&#xFF0C;&#x5C31;&#x662F;&#x4F60;&#x4EEC;&#x5E38;&#x8BF4;&#x7684;&#x7A0B;&#x5E8F;&#x733F;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x6211;&#x7A7F;&#x978B;&#xFF0C;&#x68B3;&#x5934;&#xFF0C;&#x5E7D;&#x9ED8;&#x3002;&#x505A;&#x4E3A;&#x4E00;&#x4E2A;&#x4E0D;&#x5E05;&#x7684;&#x7A0B;&#x5E8F;&#x733F;&#x6211;&#x53EA;&#x80FD;&#x9760;&#x5B9E;&#x529B;&#x751F;&#x5B58;&#x4E0B;&#x6765;&#xFF0C;&#x8FD9;&#x4E5F;&#x8981;&#x6C42;&#x6211;&#x9700;&#x8981;&#x4E0D;&#x65AD;&#x7684;&#x53BB;&#x5B66;&#x4E60;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x70B9;&#xFF0C;&#x6211;&#x6CA1;&#x6709;&#x5973;&#x670B;&#x53CB;&#xFF0C;&#x8865;&#x5145;&#x4E00;&#x70B9;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;gay&#x3002;&#x8FD9;&#x8981;&#x6C42;&#x6211;&#x66F4;&#x8981;&#x722C;&#x4E0A;&#x53BB;&#xFF0C;&#x4E0D;&#x7136;&#x5728;&#x8FD9;&#x4E2A;&#x7269;&#x6B32;&#x6A2A;&#x98DE;&#x7684;&#x793E;&#x4F1A;&#x4E2D;&#xFF0C;&#x6211;&#x8FDE;&#x4EA4;&#x914D;&#x6743;&#x90FD;&#x6CA1;&#x6709;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x5206;&#x6790;&#x7ED3;&#x679C;&#xFF0C;&#x6211;&#x5FC5;&#x987B;&#x8981;&#x6709;&#x5B9E;&#x529B;&#xFF0C;&#x5B66;&#x4E60;&#x662F;&#x6211;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x800C;&#x4E14;&#x5982;&#x679C;&#x5728;&#x8BFB;&#x7684;&#x4F60;&#x591F;&#x5E05;&#x6216;&#x8005;&#x5DF2;&#x7ECF;&#x6709;&#x5973;&#x670B;&#x53CB;&#x4E86;&#xFF0C;&#x5C31;&#x4E0D;&#x7528;&#x5F80;&#x4E0B;&#x8BFB;&#x5E76;&#x53C2;&#x4E0E;&#x548C;&#x6211;&#x7684;&#x7ADE;&#x4E89;&#x4E86;&#xFF0C;&#x72D7;&#x6025;&#x4E86;&#x53EF;&#x662F;&#x4F1A;&#x54AC;&#x4EBA;&#x7684;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/2096079-cef3e9ef7a7f2f55.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x653E;&#x5F20;&#x81EA;&#x62CD;&#x8BC1;&#x660E;&#x4E0D;&#x4E11;"></p>
<h1 id="&#x5B66;&#x4E60;"><a href="#&#x5B66;&#x4E60;" class="headerlink" title="&#x5B66;&#x4E60;"></a>&#x5B66;&#x4E60;</h1><p>&#x6211;&#x7684;&#x81EA;&#x8EAB;&#x7279;&#x70B9;&#x51B3;&#x5B9A;&#x4E86;&#x6211;&#x5FC5;&#x987B;&#x8981;&#x901A;&#x8FC7;&#x5B66;&#x4E60;&#x6765;&#x589E;&#x52A0;&#x6211;&#x7684;&#x5B9E;&#x529B;&#x3002;&#x90A3;&#x4E48;&#x5C31;&#x8981;&#x8BB2;&#x8BB2;&#x6211;&#x662F;&#x600E;&#x6837;&#x5B66;&#x4E60;&#x7684;&#x3002;</p>
<h2 id="&#x6700;&#x5E73;&#x5E38;&#x7684;&#x72B6;&#x6001;&#x5C31;&#x662F;&#x6211;&#x6700;&#x5DEE;&#x7684;&#x72B6;&#x6001;"><a href="#&#x6700;&#x5E73;&#x5E38;&#x7684;&#x72B6;&#x6001;&#x5C31;&#x662F;&#x6211;&#x6700;&#x5DEE;&#x7684;&#x72B6;&#x6001;" class="headerlink" title="&#x6700;&#x5E73;&#x5E38;&#x7684;&#x72B6;&#x6001;&#x5C31;&#x662F;&#x6211;&#x6700;&#x5DEE;&#x7684;&#x72B6;&#x6001;"></a>&#x6700;&#x5E73;&#x5E38;&#x7684;&#x72B6;&#x6001;&#x5C31;&#x662F;&#x6211;&#x6700;&#x5DEE;&#x7684;&#x72B6;&#x6001;</h2><p>&#x6839;&#x636E;&#x6211;&#x5BF9;&#x81EA;&#x5DF1;&#x751F;&#x6D3B;&#x7684;&#x53CD;&#x601D;&#xFF0C;&#x6211;&#x53D1;&#x73B0;<strong>&#x6700;&#x5E73;&#x5E38;&#x7684;&#x72B6;&#x6001;&#x5374;&#x662F;&#x6211;&#x6700;&#x5DEE;&#x7684;&#x72B6;&#x6001;</strong>&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x8BF4;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x6211;&#x53D1;&#x73B0;&#xFF0C;&#x65E0;&#x8BBA;&#x6211;&#x662F;&#x7A81;&#x7136;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x592A;&#x83DC;&#x800C;&#x5FE7;&#x8651;&#x91CD;&#x91CD;&#x4E5F;&#x597D;&#xFF0C;&#x8FD8;&#x662F;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5F97;&#x5230;&#x8BA4;&#x53EF;&#x53D7;&#x5230;&#x6FC0;&#x52B1;&#x4E5F;&#x7F62;&#x3002;&#x6211;&#x90FD;&#x4F1A;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x91CC;&#x66F4;&#x52A0;&#x52AA;&#x529B;&#xFF0C;&#x5B66;&#x4E60;&#x6548;&#x7387;&#x4E5F;&#x975E;&#x5E38;&#x9AD8;&#x3002;&#x552F;&#x72EC;&#x5728;&#x81EA;&#x5DF1;&#x5E73;&#x5E38;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6F2B;&#x65E0;&#x76EE;&#x7684;&#xFF0C;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x6574;&#x5929;&#x5728;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;&#xFF0C;&#x53C8;&#x4E0D;&#x4EE5;&#x4E3A;&#x7136;&#x3002;&#x73B0;&#x5728;&#x60F3;&#x60F3;&#x771F;&#x7684;&#x53EF;&#x6015;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x8BF4;&#xFF0C;&#x6700;&#x5E73;&#x5E38;&#x7684;&#x72B6;&#x6001;&#x5C31;&#x662F;&#x6211;&#x6700;&#x5DEE;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x800C;&#x4E14;&#x6211;&#x4E5F;&#x6E05;&#x695A;&#x7684;&#x77E5;&#x9053;&#xFF0C;&#x6211;&#x5E73;&#x5E38;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5B66;&#x4E60;&#x6548;&#x7387;&#x5E76;&#x6CA1;&#x6709;&#x591A;&#x9AD8;&#x3002;&#x6211;&#x8FD8;&#x4E0D;&#x662F;&#x90A3;&#x79CD;&#x5DF2;&#x7ECF;&#x628A;&#x9AD8;&#x6548;&#x517B;&#x6210;&#x4E60;&#x60EF;&#x7684;&#x4EBA;&#x3002;&#x8FD9;&#x4E5F;&#x6B63;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4F1A;&#x5728;&#x5FE7;&#x8651;&#x91CD;&#x91CD;&#x6216;&#x53D7;&#x5230;&#x6B63;&#x53CD;&#x9988;&#x4E4B;&#x540E;&#xFF0C;&#x53EA;&#x80FD;&#x5C06;&#x9AD8;&#x6548;&#x7387;&#x5B66;&#x4E60;&#x7EF4;&#x6301;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x539F;&#x56E0;&#x3002;&#x90A3;&#x4E48;&#x65E2;&#x7136;&#x6CA1;&#x6709;&#x8FD9;&#x79CD;&#x4E60;&#x60EF;&#xFF0C;&#x6211;&#x9009;&#x62E9;&#x8BA9;&#x81EA;&#x5DF1;&#x6301;&#x7EED;&#x6027;&#x7684;&#x6536;&#x5230;&#x6253;&#x51FB;&#x6216;&#x8005;&#x6B63;&#x53CD;&#x9988;&#x3002;&#x603B;&#x4E4B;&#x5C31;&#x662F;&#x4E0D;&#x8981;&#x5904;&#x4E8E;&#x5E73;&#x5E38;&#x7684;&#x72B6;&#x6001;&#x3002;&#x90A3;&#x4E48;&#x591A;&#x4E45;&#x4E00;&#x6B21;&#x5462;&#xFF1F;&#x8981;&#x600E;&#x4E48;&#x505A;&#x5462;&#xFF1F;</p>
<h2 id="&#x5468;&#x603B;&#x7ED3;"><a href="#&#x5468;&#x603B;&#x7ED3;" class="headerlink" title="&#x5468;&#x603B;&#x7ED3;"></a>&#x5468;&#x603B;&#x7ED3;</h2><p>&#x6839;&#x636E;&#x81EA;&#x8EAB;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x6211;&#x5728;&#x53D7;&#x5230;&#x6253;&#x51FB;&#x6216;&#x6B63;&#x53CD;&#x9988;&#x4E4B;&#x540E;&#x7684;&#x90A3;&#x4E00;&#x80A1;&#x52B2;&#xFF0C;&#x4E00;&#x822C;&#x4E0D;&#x5230;&#x4E00;&#x4E2A;&#x661F;&#x671F;&#x3002;&#x55EF;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x83DC;&#x3002;&#x90A3;&#x4E48;&#x6211;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x5468;&#x603B;&#x7ED3;&#x3002;&#x4E00;&#x5468;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x6211;&#x53EF;&#x4EE5;&#x7EF4;&#x6301;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x7684;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x5355;&#x5143;&#x3002;&#x800C;&#x603B;&#x7ED3;&#x6B63;&#x662F;&#x8BA9;&#x81EA;&#x5DF1;&#xFF0C;&#x53D7;&#x5230;&#x6253;&#x51FB;&#x6216;&#x8005;&#x6B63;&#x53CD;&#x9988;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x901A;&#x8FC7;&#x603B;&#x7ED3;&#x8FD9;&#x4E00;&#x5468;&#x81EA;&#x5DF1;&#x5B66;&#x4E60;&#x5230;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6536;&#x83B7;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5931;&#x53BB;&#x7684;&#x4E1C;&#x897F;&#x6765;&#x7ED9;&#x81EA;&#x5DF1;&#x8FD9;&#x79CD;&#x4FE1;&#x606F;&#x3002;</p>
<h3 id="&#x5468;&#x603B;&#x7ED3;&#x7684;&#x5185;&#x5BB9;"><a href="#&#x5468;&#x603B;&#x7ED3;&#x7684;&#x5185;&#x5BB9;" class="headerlink" title="&#x5468;&#x603B;&#x7ED3;&#x7684;&#x5185;&#x5BB9;"></a>&#x5468;&#x603B;&#x7ED3;&#x7684;&#x5185;&#x5BB9;</h3><p>&#x8FD9;&#x4E2A;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x6B7B;&#x6A21;&#x7248;&#xFF0C;&#x800C;&#x662F;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x7684;&#x3002;&#x6211;&#x7684;&#x4E5F;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x66F4;&#x6539;&#xFF0C;&#x628A;&#x6CA1;&#x7528;&#x7684;&#x53BB;&#x6389;&#xFF0C;&#x628A;&#x6709;&#x7528;&#x7684;&#x52A0;&#x4E0A;&#x3002;&#x90A3;&#x4E48;&#x6211;&#x8BB2;&#x4E00;&#x4E0B;&#x6211;&#x73B0;&#x5728;&#x5468;&#x603B;&#x7ED3;&#x7684;&#x5185;&#x5BB9;&#xFF1A;</p>
<h4 id="&#x9898;&#x76EE;"><a href="#&#x9898;&#x76EE;" class="headerlink" title="&#x9898;&#x76EE;"></a>&#x9898;&#x76EE;</h4><p><strong>[&#x8212;&#x9002;&#x533A;or&#x5B66;&#x4E60;&#x533A;or&#x6050;&#x614C;&#x533A;]+&#x7B2C;&#x51E0;&#x5468;</strong></p>
<p>&#x5982;&#x679C;&#x5BF9;&#x8212;&#x9002;&#x533A;&#xFF0C;&#x5B66;&#x4E60;&#x533A;&#xFF0C;&#x6050;&#x614C;&#x533A;&#x8FD8;&#x4E0D;&#x4E86;&#x89E3;&#x7684;&#x4EBA;&#xFF0C;&#x53EF;&#x4EE5;&#x968F;&#x4FBF;&#x4E0A;&#x7F51;&#x641C;&#x7D22;&#x4E00;&#x4E0B;&#x5B83;&#x4EEC;&#x7684;&#x610F;&#x601D;&#x3002;&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x4E0A;&#x9762;&#x8BB2;&#x7684;&#x6700;&#x5E73;&#x5E38;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x90FD;&#x662F;&#x5904;&#x4E8E;&#x8212;&#x9002;&#x533A;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FD9;&#x4E24;&#x4E2A;&#x5185;&#x5BB9;&#x5462;&#xFF1F;</p>
<p>&#x4E2D;&#x62EC;&#x53F7;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x9192;&#x76EE;&#xFF0C;&#x53EF;&#x4EE5;&#x4E00;&#x76EE;&#x4E86;&#x7136;&#x81EA;&#x5DF1;&#x8FD9;&#x4E00;&#x5468;&#x5904;&#x5728;&#x600E;&#x6837;&#x7684;&#x72B6;&#x6001;&#x3002;&#x8FD9;&#x8BA9;&#x81EA;&#x5DF1;&#x5728;&#x4E4B;&#x540E;&#x56DE;&#x987E;&#x7684;&#x65F6;&#x5019;&#x6709;&#x4E00;&#x4E2A;&#x5FEB;&#x901F;&#x7684;&#x8BA4;&#x8BC6;&#x3002;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x6BCF;&#x6B21;&#x628A;&#x8FD9;&#x7BC7;&#x5468;&#x603B;&#x7ED3;&#x8BFB;&#x4E00;&#x904D;&#xFF0C;&#x518D;&#x5206;&#x6790;&#x51FA;&#x81EA;&#x5DF1;&#x8FD9;&#x5468;&#x6240;&#x5904;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x540E;&#x9762;&#x7684;&#x7B2C;&#x51E0;&#x5468;&#xFF0C;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x79CD;&#x6B63;&#x53CD;&#x9988;&#x3002;&#x56E0;&#x4E3A;&#x575A;&#x6301;&#x96BE;&#x80FD;&#x53EF;&#x8D35;&#x3002;&#x5F53;&#x4F60;&#x53D1;&#x73B0;&#x540E;&#x9762;&#x7684;&#x6570;&#x5B57;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x53D8;&#x5927;&#xFF0C;&#x4F60;&#x4E5F;&#x4F1A;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x575A;&#x6301;&#x611F;&#x5230;&#x81EA;&#x8C6A;&#x3002;</p>
<h4 id="&#x5DE5;&#x4F5C;&#x76F8;&#x5173;"><a href="#&#x5DE5;&#x4F5C;&#x76F8;&#x5173;" class="headerlink" title="&#x5DE5;&#x4F5C;&#x76F8;&#x5173;"></a>&#x5DE5;&#x4F5C;&#x76F8;&#x5173;</h4><ol>
<li><strong>&#x505A;&#x4E86;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;</strong></li>
<li><strong>&#x9047;&#x5230;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x7684;</strong></li>
</ol>
<p>&#x7B2C;&#x4E00;&#x70B9;&#x662F;&#x5BF9;&#x81EA;&#x5DF1;&#x5DE5;&#x4F5C;&#x7684;&#x4E00;&#x79CD;&#x603B;&#x7ED3;&#xFF0C;&#x5F53;&#x7136;&#x4E0D;&#x9650;&#x4E8E;&#x5DE5;&#x4F5C;&#xFF0C;&#x7531;&#x4E8E;&#x5DE5;&#x4F5C;&#x5728;&#x6211;&#x7684;&#x4E00;&#x5929;&#x5F53;&#x4E2D;&#x5360;&#x7684;&#x6BD4;&#x4F8B;&#x6700;&#x5927;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x5927;&#x591A;&#x662F;&#x6211;&#x5DE5;&#x4F5C;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x5BF9;&#x81EA;&#x5DF1;&#x5DE5;&#x4F5C;&#x6709;&#x4E00;&#x4E2A;&#x5B8F;&#x89C2;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8FD9;&#x4E00;&#x5468;&#x627F;&#x62C5;&#x4E86;&#x4E00;&#x9879;&#x5BF9;&#x4E8E;&#x516C;&#x53F8;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E76;&#x5B8C;&#x6210;&#x4E86;&#xFF0C;&#x8FD9;&#x672C;&#x8EAB;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x6B63;&#x53CD;&#x9988;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x70B9;&#x662F;&#x5BF9;&#x95EE;&#x9898;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x4EC5;&#x9650;&#x4E8E;&#x5DE5;&#x4F5C;&#x5185;&#x5BB9;&#x7684;&#x5177;&#x4F53;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x53CA;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x53D1;&#x751F;&#x8BA9;&#x4F60;&#x6548;&#x7387;&#x5F88;&#x4F4E;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x95EE;&#x9898;&#x3002;&#x800C;&#x8FD9;&#x91CC;&#x603B;&#x7ED3;&#x4E00;&#x5468;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x540E;&#x6539;&#x6B63;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x4E0D;&#x518D;&#x72AF;&#x540C;&#x6837;&#x7684;&#x9519;&#x8BEF;&#x3002;</p>
<h4 id="&#x5B66;&#x4E60;&#x603B;&#x7ED3;"><a href="#&#x5B66;&#x4E60;&#x603B;&#x7ED3;" class="headerlink" title="&#x5B66;&#x4E60;&#x603B;&#x7ED3;"></a>&#x5B66;&#x4E60;&#x603B;&#x7ED3;</h4><p><strong>&#x65B0;&#x5B66;&#x4E60;&#x5230;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#xFF1F;</strong></p>
<p>&#x6CE8;&#x610F;&#x662F;&#x65B0;&#xFF0C;&#x8001;&#x7684;&#x4E0D;&#x7B97;&#x3002;&#x8FD9;&#x4E00;&#x822C;&#x662F;&#x6211;&#x53D7;&#x5230;&#x6253;&#x51FB;&#x548C;&#x6FC0;&#x52B1;&#x7684;&#x76F4;&#x63A5;&#x5185;&#x5BB9;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x53D1;&#x73B0;&#x8FD9;&#x4E00;&#x5468;&#xFF0C;&#x5728;&#x8FD9;&#x4E00;&#x5757;&#x51E0;&#x4E4E;&#x5199;&#x4E0D;&#x51FA;&#x4E1C;&#x897F;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x5FC3;&#x91CC;&#x4E00;&#x5B9A;&#x4E0D;&#x4F1A;&#x5F88;&#x8212;&#x670D;&#x3002;</p>
<h4 id="&#x6700;&#x7EC8;&#x603B;&#x7ED3;"><a href="#&#x6700;&#x7EC8;&#x603B;&#x7ED3;" class="headerlink" title="&#x6700;&#x7EC8;&#x603B;&#x7ED3;"></a>&#x6700;&#x7EC8;&#x603B;&#x7ED3;</h4><p>&#x4E3B;&#x8981;&#x662F;&#x4E3A;&#x4E0B;&#x4E00;&#x5468;&#x505A;&#x51B3;&#x7B56;&#xFF1A;</p>
<ol>
<li>&#x54EA;&#x4E9B;&#x662F;&#x8981;&#x7EE7;&#x7EED;&#x4FDD;&#x6301;&#x7684;</li>
<li>&#x54EA;&#x4E9B;&#x662F;&#x5E94;&#x8BE5;&#x820D;&#x5F03;&#x7684;</li>
<li>&#x54EA;&#x4E9B;&#x662F;&#x8981;&#x907F;&#x514D;&#x518D;&#x6B64;&#x53D1;&#x751F;&#x7684;&#x3002;</li>
</ol>
<h4 id="&#x76EE;&#x6807;"><a href="#&#x76EE;&#x6807;" class="headerlink" title="&#x76EE;&#x6807;"></a>&#x76EE;&#x6807;</h4><p>&#x738B;&#x5065;&#x6797;&#x7ED9;&#x5E74;&#x8F7B;&#x4EBA;&#x7684;&#x5EFA;&#x8BAE;&#x561B;&#xFF0C;&#x6211;&#x5148;&#x6323;&#x5B83;&#x4E00;&#x4E2A;&#x4EBF;&#x3002;&#x76EE;&#x6807;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x5F88;&#x91CD;&#x8981;&#x4E0D;&#x7136;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x6CA1;&#x5934;&#x82CD;&#x8747;&#x3002;&#x800C;&#x4E14;&#x5F53;&#x4F60;&#x5B8C;&#x6210;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x76EE;&#x6807;&#x4F60;&#x4E5F;&#x4F1A;&#x6536;&#x5230;&#x6B63;&#x53CD;&#x9988;&#x3002;&#x4E00;&#x822C;&#x6211;&#x7684;&#x76EE;&#x6807;&#x671F;&#x9650;&#x662F;&#x4E00;&#x5468;&#x3002;</p>
<blockquote>
<p>&#x6682;&#x65F6;&#x6211;&#x7684;&#x5468;&#x603B;&#x7ED3;&#x662F;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#xFF0C;&#x56DE;&#x987E;&#x4E00;&#x5468;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x5B8C;&#x6210;&#x8FD9;&#x4EFD;&#x5468;&#x603B;&#x7ED3;&#x6240;&#x7528;&#x65F6;&#x95F4;&#x5927;&#x7EA6;&#x4E3A;40&#x5206;&#x949F;&#x5230;1&#x4E2A;&#x5C0F;&#x65F6;&#x3002;&#x6BCF;&#x5468;&#x65E5;&#x665A;&#x4E0A;10&#x70B9;&#x8FDB;&#x884C;&#x3002;</p>
</blockquote>
<p><img src="http://upload-images.jianshu.io/upload_images/2096079-3214365da373ba92.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x770B;&#x5C4F;&#x5E55;&#x4E45;&#x4E86;&#x653E;&#x4E0B;&#x773C;&#x955C;&#x7F13;&#x4E00;&#x7F13;&#x5427;(&#x4E0B;&#x9762;&#x8FD8;&#x6709;)"></p>
<h2 id="&#x5B66;&#x4E60;&#x7F13;&#x51B2;&#x533A;"><a href="#&#x5B66;&#x4E60;&#x7F13;&#x51B2;&#x533A;" class="headerlink" title="&#x5B66;&#x4E60;&#x7F13;&#x51B2;&#x533A;"></a>&#x5B66;&#x4E60;&#x7F13;&#x51B2;&#x533A;</h2><p>&#x5468;&#x603B;&#x7ED3;&#x6BCF;&#x5468;&#x90FD;&#x5728;&#x8FDB;&#x884C;&#xFF0C;&#x6BCF;&#x5468;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x76EE;&#x6807;&#x4EFB;&#x52A1;&#x3002;&#x800C;&#x5BF9;&#x4E8E;&#x6211;&#x672C;&#x8EAB;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E1A;&#x4F59;&#x65F6;&#x95F4;&#x4E0D;&#x591A;&#xFF0C;&#x5982;&#x679C;&#x6BCF;&#x9047;&#x5230;&#x4E00;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x8FDB;&#x884C;&#x6DF1;&#x5165;&#x7814;&#x7A76;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x6D88;&#x8017;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x3002;(&#x4EE5;&#x524D;&#x6211;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x505A;&#x7684;)&#x8BE5;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x5176;&#x5B9E;&#x4E5F;&#x4E0D;&#x53EB;&#x5927;&#x91CF;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x5929;&#x7684;&#x4E1A;&#x4F59;&#x65F6;&#x95F4;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x4E24;&#x5929;&#x3002;&#x4E8E;&#x662F;&#x4E4E;&#xFF0C;&#x81EA;&#x5DF1;&#x65E2;&#x5B9A;&#x76EE;&#x6807;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x6BD4;&#x5982;A&#x4E8B;&#x60C5;&#x662F;&#x4F60;&#x5B9A;&#x4E0B;&#x4E00;&#x5468;&#x8981;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x6709;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x5E72;&#x4E86;&#x4E00;&#x5929;A&#x4E8B;&#x60C5;&#xFF0C;&#x7A81;&#x7136;B&#x4E8B;&#x60C5;&#x6765;&#x4E86;&#xFF0C;&#x4F60;&#x5728;B&#x4E8B;&#x60C5;&#x4E0A;&#x82B1;&#x4E86;&#x4E24;&#x5929;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x518D;&#x56DE;&#x6765;&#x5E72;A&#x4E8B;&#x60C5;&#xFF0C;&#x4F60;&#x7684;&#x6FC0;&#x60C5;&#x548C;&#x72B6;&#x6001;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x4E0D;&#x540C;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x4F60;&#x8FD8;&#x9700;&#x8981;&#x56DE;&#x987E;&#x4F60;&#x4E0A;&#x6B21;A&#x4E8B;&#x60C5;&#x505A;&#x5230;&#x54EA;&#x91CC;&#x4E86;&#x3002;&#x7136;&#x540E;&#x4F60;&#x53C8;&#x505A;&#x4E86;A&#x4E8B;&#x60C5;&#x4E00;&#x5929;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;C&#x4E8B;&#x60C5;&#x53C8;&#x6765;&#x4E86;&#xFF0C;&#x4F60;&#x5728;C&#x4E8B;&#x60C5;&#x4E0A;&#x53C8;&#x82B1;&#x4E86;&#x4E00;&#x5929;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x7684;A&#x4E8B;&#x60C5;&#x88AB;&#x4E0D;&#x65AD;&#x7684;&#x5EF6;&#x671F;&#xFF0C;&#x76F4;&#x5230;&#x4F60;&#x4E0D;&#x60F3;&#x518D;&#x505A;A&#x4E8B;&#x60C5;&#x3002;&#x5230;&#x6700;&#x540E;&#x7ED9;&#x81EA;&#x5DF1;&#x627E;&#x4E2A;&#x501F;&#x53E3;&#x8BF4;&#xFF0C;&#x73B0;&#x5728;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#xFF0C;&#x7B49;&#x4EE5;&#x540E;&#x627E;&#x4E2A;&#x5927;&#x5757;&#x7684;&#x4E8B;&#x60C5;&#x518D;&#x6765;&#x641E;A&#x5427;&#x3002;&#x7136;&#x540E;&#x4F60;&#x53D1;&#x60F3;&#x4F60;&#x6839;&#x672C;&#x5C31;&#x4E0D;&#x4F1A;&#x6709;&#x5927;&#x5757;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x7684;&#x65F6;&#x95F4;&#x90FD;&#x88AB;&#x90A3;&#x4E9B;&#x96F6;&#x788E;&#x4E8B;&#x60C5;&#x788E;&#x7247;&#x5316;&#x4E86;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x6211;&#x4E3A;&#x6211;&#x7684;&#x5B66;&#x4E60;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x7F13;&#x51B2;&#x533A;&#x3002;&#x5F53;&#x6211;&#x5DE5;&#x4F5C;&#x4E2D;&#x9047;&#x5230;&#x4E86;&#x8BF8;&#x5982;B&#x4E8B;&#x60C5;&#x6216;&#x8005;C&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x603B;&#x662F;&#x9002;&#x53EF;&#x800C;&#x6B62;&#x3002;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;bug&#x51FA;&#x73B0;&#x4E86;&#xFF0C;&#x6211;&#x5728;stackOverFlow&#x4E0A;&#x627E;&#x5230;&#x4E86;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x95EE;&#x9898;&#xFF0C;OK&#x4E86;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6211;&#x89C9;&#x5F97;&#x6709;&#x6DF1;&#x5165;&#x7814;&#x7A76;&#x7684;&#x5FC5;&#x8981;&#x6211;&#x4E5F;&#x4E0D;&#x4F1A;&#x9A6C;&#x4E0A;&#x53BB;&#x8FDB;&#x884C;&#xFF0C;&#x800C;&#x662F;&#x628A;&#x5B83;&#x8BB0;&#x5F55;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x5B66;&#x4E60;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x3002;&#x7136;&#x540E;&#x5DE5;&#x4F5C;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x6B63;&#x5E38;&#x8FDB;&#x884C;&#xFF0C;&#x4E1A;&#x4F59;&#x65F6;&#x95F4;&#x7EE7;&#x7EED;&#x505A;&#x81EA;&#x5DF1;&#x672C;&#x5468;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x7136;&#x540E;&#x6BCF;&#x5468;&#x7ED3;&#x675F;&#x7684;&#x65F6;&#x5019;&#x770B;&#x4E00;&#x4E0B;&#x5B66;&#x4E60;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x5982;&#x679C;&#x5927;&#x4E8E;&#x7B49;&#x4E8E;4&#x4E2A;&#xFF0C;&#x4E0B;&#x4E00;&#x5468;&#x76EE;&#x6807;&#x4EFB;&#x52A1;&#x5C31;&#x662F;&#x6E05;&#x7A7A;&#x5B66;&#x4E60;&#x7F13;&#x51B2;&#x533A;&#x3002;</p>
<h2 id="One-By-One"><a href="#One-By-One" class="headerlink" title="One By One"></a>One By One</h2><p>&#x518D;&#x6709;&#x4E00;&#x70B9;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x5DE5;&#x4F5C;&#x8FD8;&#x662F;&#x4E1A;&#x4F59;&#x65F6;&#x95F4;&#x5B66;&#x4E60;&#xFF0C;&#x90FD;&#x8981;&#x9075;&#x5FAA;&#x4E00;&#x4E2A;&#x539F;&#x5219;&#xFF0C;&#x5C31;&#x662F;&#x4E8B;&#x60C5;&#x4E00;&#x4EF6;&#x4E00;&#x4EF6;&#x6765;&#x3002;&#x6709;&#x5F88;&#x591A;&#x4EBA;&#x89C9;&#x5F97;&#x773C;&#x89C2;&#x516D;&#x8DEF;&#x8033;&#x542C;&#x516B;&#x65B9;&#xFF0C;&#x540C;&#x65F6;&#x53EF;&#x4EE5;&#x505A;&#x51E0;&#x4EF6;&#x4E8B;&#x60C5;&#x975E;&#x5E38;&#x4E86;&#x4E0D;&#x8D77;&#x3002;&#x55EF;&#xFF0C;&#x6211;&#x627F;&#x8BA4;&#xFF0C;&#x786E;&#x5B9E;&#x4E86;&#x4E0D;&#x8D77;&#x3002;&#x4F46;&#x6211;&#x7684;&#x786E;&#x662F;&#x4E00;&#x4E2A;&#x4E00;&#x822C;&#x4EBA;&#xFF0C;&#x4E5F;&#x4E0D;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x662F;&#x4E2A;&#x8D85;&#x4EBA;&#x3002;&#x6709;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x6211;&#x6DF1;&#x53D7;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x88AB;&#x6253;&#x65AD;&#xFF0C;&#x7136;&#x540E;&#x505A;&#x53E6;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x4E4B;&#x540E;&#x518D;&#x56DE;&#x6765;&#x7EE7;&#x7EED;&#x505A;&#x4E8B;&#x60C5;&#x7684;&#x56F0;&#x6270;&#x3002;&#x800C;&#x4E14;&#x6709;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x662F;&#x5916;&#x5728;&#x539F;&#x56E0;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x4E3A;&#x81EA;&#x5DF1;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x6700;&#x597D;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#xFF0C;&#x6BCF;&#x5929;&#x65E9;&#x4E0A;&#x4E0A;&#x5395;&#x6240;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#x4ECA;&#x5929;&#x8981;&#x505A;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x7136;&#x540E;&#x5217;&#x4E00;&#x4E2A;&#x6E05;&#x5355;&#x3002;&#x5982;&#x679C;&#x6709;&#x5FC5;&#x8981;&#x628A;&#x65F6;&#x95F4;&#x4E5F;&#x5199;&#x4E0A;&#x3002;&#x6211;&#x5728;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x7684;&#x6EF4;&#x7B54;&#x6E05;&#x5355;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x3002;&#x800C;&#x4E14;&#x8FD9;&#x79CD;&#x8F6F;&#x4EF6;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x53EF;&#x4EE5;&#x968F;&#x4FBF;&#x627E;&#xFF0C;&#x7528;&#x54EA;&#x4E2A;&#x65E0;&#x6240;&#x8C13;&#x3002;&#x4E4B;&#x540E;&#x5C31;&#x662F;&#x4E00;&#x4EF6;&#x4E00;&#x4EF6;&#x7684;&#x5B8C;&#x6210;&#x4ECA;&#x5929;&#x7684;&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x3002;&#x8FD9;&#x6837;&#x6CA1;&#x6709;&#x6253;&#x65AD;&#x7684;&#x5DE5;&#x4F5C;&#x6216;&#x8005;&#x5B66;&#x4E60;&#xFF0C;&#x6548;&#x7387;&#x6760;&#x6760;&#x7684;&#x3002;&#x5F53;&#x4F60;&#x9047;&#x5230;&#x6709;&#x8981;&#x6253;&#x65AD;&#x4F60;&#x5DE5;&#x4F5C;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5148;&#x653E;&#x4E00;&#x653E;&#xFF0C;&#x5728;&#x91CC;&#x9762;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4E4B;&#x540E;&#x89E3;&#x51B3;&#x3002;&#x5982;&#x679C;&#x6D89;&#x53CA;&#x5176;&#x5B83;&#x4EBA;&#x7D27;&#x6025;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x53BB;&#x505A;&#xFF0C;&#x56DE;&#x6765;&#x7684;&#x65F6;&#x5019;&#x770B;&#x6E05;&#x5355;&#x4E2D;&#x4F60;&#x6B63;&#x5728;&#x505A;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x6BD4;&#x8F83;&#x5FEB;&#x7684;&#x56DE;&#x5FC6;&#x8D77;&#x6765;&#x3002;</p>
<h2 id="&#x6536;&#x85CF;"><a href="#&#x6536;&#x85CF;" class="headerlink" title="&#x6536;&#x85CF;"></a>&#x6536;&#x85CF;</h2><p>&#x5BF9;&#x4E8E;&#x6211;&#x81EA;&#x8EAB;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x53EF;&#x4EE5;&#x8BF4;&#x5360;&#x5230;&#x4E86;&#x6211;&#x751F;&#x6D3B;&#x7684;85%&#x4EE5;&#x4E0A;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x6BCF;&#x5468;&#x8FD8;&#x4F1A;&#x51FA;&#x53BB;&#x73A9;&#x4E00;&#x73A9;&#xFF0C;&#x54C8;&#x54C8;&#x3002;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x7684;&#x8BDD;&#xFF0C;&#x57FA;&#x672C;&#x6574;&#x5929;&#x90FD;&#x4F1A;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x3002;&#x90A3;&#x4E48;&#x6211;&#x5728;&#x7F51;&#x4E0A;&#x6D4F;&#x89C8;&#x7684;&#x5185;&#x5BB9;&#x5F88;&#x591A;&#xFF0C;&#x6211;&#x7684;&#x5927;&#x591A;&#x6570;&#x4FE1;&#x606F;&#x90FD;&#x662F;&#x6765;&#x6E90;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x3002;&#x90A3;&#x4E48;&#x770B;&#x5230;&#x597D;&#x7684;&#x4E1C;&#x897F;&#x8981;&#x60F3;&#x51ED;&#x8BB0;&#x5FC6;&#x8BB0;&#x4F4F;&#x771F;&#x7684;&#x592A;&#x96BE;&#x4E86;&#x3002;&#x6211;&#x81EA;&#x8EAB;&#x4E5F;&#x4E0D;&#x62E5;&#x6709;&#x90A3;&#x79CD;&#x8FC7;&#x76EE;&#x4E0D;&#x5FD8;&#x7684;&#x80FD;&#x529B;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x770B;&#x5230;&#x597D;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x7684;&#x6536;&#x85CF;&#x8D77;&#x6765;&#xFF0C;&#x518D;&#x5230;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x7684;&#x627E;&#x5230;&#xFF0C;&#x5219;&#x4F1A;&#x63D0;&#x9AD8;&#x6211;&#x4EEC;&#x7684;&#x5B66;&#x4E60;&#x548C;&#x5DE5;&#x4F5C;&#x7684;&#x6548;&#x7387;&#x3002;&#x8FD9;&#x91CC;&#x6709;&#x4E24;&#x4E2A;&#x8F6F;&#x4EF6;&#x63A8;&#x8350;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x56FD;&#x5185;&#x7684;&#x52FA;&#x5B50;&#x6536;&#x85CF;&#x5939;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x56FD;&#x5916;&#x7684;Pocket&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x6211;&#x66F4;&#x559C;&#x6B22;&#x52FA;&#x5B50;&#x6536;&#x85CF;&#x5939;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x754C;&#x9762;&#x6211;&#x66F4;&#x559C;&#x6B22;&#x3002;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E2A;&#x65E0;&#x4F24;&#x5927;&#x96C5;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x5B9A;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x3002;&#x5B66;&#x4F1A;&#x628A;&#x6709;&#x7528;&#x7684;&#x6536;&#x85CF;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x800C;&#x4E14;&#x5BF9;&#x4E8E;&#x81EA;&#x5DF1;&#x89C9;&#x5F97;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x5185;&#x5BB9;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x5220;&#x9664;&#xFF0C;&#x8BB0;&#x5F97;&#x5907;&#x4EFD;&#x5230;&#x672C;&#x5730;&#x4E00;&#x4EFD;&#x3002;&#x5965;&#x5BF9;&#x4E86;&#xFF0C;&#x5FD8;&#x4E86;&#x8BB2;&#xFF0C;&#x8FD9;&#x91CC;&#x4EE5;&#x53CA;&#x4E0A;&#x9762;&#x7684;&#x5468;&#x603B;&#x7ED3;&#x548C;&#x5B66;&#x4E60;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x6211;&#x90FD;&#x662F;&#x4F7F;&#x7528;&#x7684;&#x5370;&#x8C61;&#x7B14;&#x8BB0;&#x8BB0;&#x5F55;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x4E5F;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x79CD;&#x8F6F;&#x4EF6;&#x4E5F;&#x5F88;&#x591A;&#xFF0C;&#x968F;&#x4FBF;&#x627E;&#x4E00;&#x4E2A;&#x6765;&#x7528;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x5927;&#x540C;&#x5C0F;&#x5F02;&#xFF0C;&#x4F46;&#x4E00;&#x5B9A;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x3002;&#x8FD9;&#x91CC;&#x9009;&#x4E2D;&#x6709;&#x7528;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5305;&#x62EC;&#x56FE;&#x7247;&#xFF0C;&#x76F4;&#x63A5;&#x590D;&#x5236;&#x7C98;&#x8D34;&#x5230;&#x5370;&#x8C61;&#x7B14;&#x8BB0;&#x4E2D;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</p>
<h2 id="&#x505A;&#x7B14;&#x8BB0;"><a href="#&#x505A;&#x7B14;&#x8BB0;" class="headerlink" title="&#x505A;&#x7B14;&#x8BB0;"></a>&#x505A;&#x7B14;&#x8BB0;</h2><p>&#x7B14;&#x8BB0;&#x5728;&#x6211;&#x770B;&#x6765;&#x6709;&#x4E24;&#x79CD;&#x3002;&#x4E00;&#x79CD;&#x662F;&#x8BFB;&#x4E66;&#x8BFB;&#x6587;&#x7AE0;&#x7684;&#x7B14;&#x8BB0;&#x3002;&#x4E00;&#x79CD;&#x662F;&#x96F6;&#x6563;&#x7684;&#x7B14;&#x8BB0;&#x3002;</p>
<p>&#x6709;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x8BFB;&#x4E66;&#x6216;&#x8005;&#x8BFB;&#x6587;&#x7AE0;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5185;&#x5BB9;&#x901A;&#x5E38;&#x4F1A;&#x6BD4;&#x8F83;&#x957F;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x6211;&#x4EEC;&#x9047;&#x5230;&#x95EE;&#x9898;&#x518D;&#x60F3;&#x627E;&#x8FD9;&#x91CC;&#x9762;&#x7684;&#x6709;&#x7528;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F60;&#x8981;&#x518D;&#x8BFB;&#x4E00;&#x904D;&#x5417;&#xFF1F;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6CA1;&#x6709;&#x505A;&#x7B14;&#x8BB0;&#xFF0C;&#x53EA;&#x80FD;&#x51ED;&#x501F;&#x81EA;&#x5DF1;&#x4E2A;&#x5370;&#x8C61;&#xFF0C;&#x53BB;&#x5168;&#x6587;&#x4E2D;&#x67E5;&#x627E;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x7EB8;&#x8D28;&#x4E66;&#x4F60;&#x66F4;&#x4E0D;&#x53EF;&#x80FD;Ctrl+F(&#x7F51;&#x9875;&#x4E2D;&#x67E5;&#x627E;&#x7684;&#x5FEB;&#x6377;&#x952E;&#xFF0C;&#x901A;&#x5E38;&#x5728;&#x7F51;&#x9875;&#x4E2D;&#x67E5;&#x627E;&#x5173;&#x952E;&#x5B57;&#x65F6;&#x4F7F;&#x7528;)&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x505A;&#x4E86;&#x7B14;&#x8BB0;&#xFF0C;&#x90A3;&#x4E48;&#x901F;&#x5EA6;&#x5C06;&#x4F1A;&#x63D0;&#x9AD8;&#x6570;&#x500D;&#x3002;&#x800C;&#x4E14;&#x4F60;&#x8BB0;&#x8FC7;&#x7684;&#x7B14;&#x8BB0;&#x4E5F;&#x4F1A;&#x5370;&#x8C61;&#x66F4;&#x52A0;&#x6DF1;&#x523B;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4E0D;&#x4EC5;&#x5BF9;&#x4E8E;&#x4E66;&#x4F1A;&#x505A;&#x7B14;&#x8BB0;&#xFF0C;&#x5BF9;&#x4E8E;&#x7F51;&#x4E0A;&#x6BD4;&#x8F83;&#x957F;&#x7684;&#x6587;&#x7AE0;&#x4E5F;&#x4F1A;&#x53BB;&#x505A;&#x7B14;&#x8BB0;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x662F;&#x6BD4;&#x8F83;&#x96F6;&#x6563;&#x7684;&#x7B14;&#x8BB0;&#x3002;&#x8FD9;&#x79CD;&#x7B14;&#x8BB0;&#x5F80;&#x5F80;&#x662F;&#x4E00;&#x4E9B;&#x5C0F;&#x7EC6;&#x8282;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;LinkedList&#x522B;&#x5728;&#x5FAA;&#x73AF;&#x4E2D;&#x4E00;&#x76F4;get(i)&#x5440;&#xFF0C;if&#x8BED;&#x53E5;&#x5148;&#x628A;&#x4E24;&#x4E2A;&#x5206;&#x652F;&#x90FD;&#x5199;&#x51FA;&#x6765;&#x518D;&#x7B80;&#x5316;&#x5440;&#xFF0C;&#x4E0D;&#x8981;&#x8F7B;&#x6613;&#x7684;&#x628A;&#x4E00;&#x4E2A;&#x7C7B;&#x5185;&#x90E8;&#x7684;List&#x7684;&#x5F15;&#x7528;&#x8BA9;&#x5916;&#x90E8;get&#x5230;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x4F7F;&#x7528;Collections&#x7684;unmodifiableList&#x65B9;&#x6CD5;&#x4E3A;&#x5176;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x4E0D;&#x53EF;&#x53D8;&#x7684;List&#x5440;&#x2026;&#x2026;&#x8FD9;&#x4E9B;&#x5C0F;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x9047;&#x5230;&#x4E00;&#x4E2A;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#xFF0C;&#x65F6;&#x4E0D;&#x65F6;&#x62FF;&#x51FA;&#x6765;&#x770B;&#x4E00;&#x904D;&#xFF0C;&#x52A0;&#x6DF1;&#x5370;&#x8C61;&#x3002;</p>
<h1 id="&#x7ED3;&#x675F;&#x8BED;"><a href="#&#x7ED3;&#x675F;&#x8BED;" class="headerlink" title="&#x7ED3;&#x675F;&#x8BED;"></a>&#x7ED3;&#x675F;&#x8BED;</h1><p>&#x73B0;&#x5728;&#x60F3;&#x60F3;&#x81EA;&#x5DF1;&#x5728;&#x5B66;&#x6821;&#x6DF7;&#x7684;&#x65E5;&#x5B50;&#x771F;&#x7684;&#x662F;&#x592A;&#x6D6A;&#x8D39;&#x4E86;&#x3002;&#x5E0C;&#x671B;&#x521A;&#x4E0A;&#x5B66;&#x7684;&#x4F60;&#x80FD;&#x73CD;&#x60DC;&#x5B66;&#x751F;&#x65F6;&#x4EE3;&#x7684;&#x65F6;&#x5149;&#x3002;&#x4E5F;&#x5E0C;&#x671B;&#x50CF;&#x6211;&#x4E00;&#x6837;&#x8131;&#x79BB;&#x4E86;&#x5B66;&#x751F;&#x65F6;&#x4EE3;&#x7684;&#x4F60;&#x80FD;&#x4EE5;&#x66F4;&#x597D;&#x7684;&#x72B6;&#x6001;&#x53BB;&#x5B66;&#x4E60;&#x3002;</p>
<p>&#x4F60;&#x4E5F;&#x6839;&#x636E;&#x81EA;&#x8EAB;&#x7684;&#x7279;&#x70B9;&#x53BB;&#x8BBE;&#x8BA1;&#x4E00;&#x5957;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x5427;&#x3002;&#x518D;&#x6B21;&#x5949;&#x529D;&#xFF0C;&#x957F;&#x7684;&#x5E05;&#x7684;&#x548C;&#x6709;&#x5973;&#x670B;&#x53CB;&#x7684;&#x624B;&#x4E0B;&#x7559;&#x60C5;&#xFF0C;&#x4E0D;&#x7136;&#x771F;&#x7684;&#x8981;&#x54AC;&#x4EBA;&#x4E86;!</p>

      
    </div>

    <div>
      
        
      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/09/09/六芒星ImageView/" rel="next" title="六芒(bian)星(xing)ImageView">
                <i class="fa fa-chevron-left"></i> 六芒(bian)星(xing)ImageView
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/09/14/把RecyclerView做成-马-蜂-窝/" rel="prev" title="把RecyclerView撸成 马 蜂 窝(自定义LayoutManager)">
                把RecyclerView撸成 马 蜂 窝(自定义LayoutManager) <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/09/10/离开学校的我却更会学习了/"
           data-title="离开学校的我却更会学习了" data-url="https://chacojack.github.io/2016/09/10/离开学校的我却更会学习了/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.png"
               alt="柴泽建" />
          <p class="site-author-name" itemprop="name">柴泽建</p>
          <p class="site-description motion-element" itemprop="description">对代码永不满足</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">22</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              
                <span class="site-state-item-count">1</span>
                <span class="site-state-item-name">标签</span>
              
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/Chacojack" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/2703310877" target="_blank" title="Weibo">
                  
                    <i class="fa fa-fw fa-weibo"></i>
                  
                  Weibo
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.jianshu.com/users/dd5f6394457d/latest_articles" target="_blank" title="Jianshu">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  Jianshu
                </a>
              </span>
            
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-1"><a class="nav-link" href="#分析自身特点"><span class="nav-number">1.</span> <span class="nav-text">分析自身特点</span></a></li><li class="nav-item nav-level-1"><a class="nav-link" href="#学习"><span class="nav-number">2.</span> <span class="nav-text">学习</span></a><ol class="nav-child"><li class="nav-item nav-level-2"><a class="nav-link" href="#最平常的状态就是我最差的状态"><span class="nav-number">2.1.</span> <span class="nav-text">最平常的状态就是我最差的状态</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#周总结"><span class="nav-number">2.2.</span> <span class="nav-text">周总结</span></a><ol class="nav-child"><li class="nav-item nav-level-3"><a class="nav-link" href="#周总结的内容"><span class="nav-number">2.2.1.</span> <span class="nav-text">周总结的内容</span></a><ol class="nav-child"><li class="nav-item nav-level-4"><a class="nav-link" href="#题目"><span class="nav-number">2.2.1.1.</span> <span class="nav-text">题目</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#工作相关"><span class="nav-number">2.2.1.2.</span> <span class="nav-text">工作相关</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#学习总结"><span class="nav-number">2.2.1.3.</span> <span class="nav-text">学习总结</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#最终总结"><span class="nav-number">2.2.1.4.</span> <span class="nav-text">最终总结</span></a></li><li class="nav-item nav-level-4"><a class="nav-link" href="#目标"><span class="nav-number">2.2.1.5.</span> <span class="nav-text">目标</span></a></li></ol></li></ol></li><li class="nav-item nav-level-2"><a class="nav-link" href="#学习缓冲区"><span class="nav-number">2.3.</span> <span class="nav-text">学习缓冲区</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#One-By-One"><span class="nav-number">2.4.</span> <span class="nav-text">One By One</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#收藏"><span class="nav-number">2.5.</span> <span class="nav-text">收藏</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#做笔记"><span class="nav-number">2.6.</span> <span class="nav-text">做笔记</span></a></li></ol></li><li class="nav-item nav-level-1"><a class="nav-link" href="#结束语"><span class="nav-number">3.</span> <span class="nav-text">结束语</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">柴泽建</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"jack-chai-notes"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  






  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
       search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();

    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
    'use strict';
    $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
            // get the contents from search data
            isfetched = true;
            $('.popup').detach().appendTo('.header-inner');
            var datas = $( "entry", xmlResponse ).map(function() {
                return {
                    title: $( "title", this ).text(),
                    content: $("content",this).text(),
                    url: $( "url" , this).text()
                };
            }).get();
            var $input = document.getElementById(search_id);
            var $resultContent = document.getElementById(content_id);
            $input.addEventListener('input', function(){
                var matchcounts = 0;
                var str='<ul class=\"search-result-list\">';                
                var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
                $resultContent.innerHTML = "";
                if (this.value.trim().length > 1) {
                // perform local searching
                datas.forEach(function(data) {
                    var isMatch = true;
                    var content_index = [];
                    var data_title = data.title.trim().toLowerCase();
                    var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                    var data_url = data.url;
                    var index_title = -1;
                    var index_content = -1;
                    var first_occur = -1;
                    // only match artiles with not empty titles and contents
                    if(data_title != '' && data_content != '') {
                        keywords.forEach(function(keyword, i) {
                            index_title = data_title.indexOf(keyword);
                            index_content = data_content.indexOf(keyword);
                            if( index_title < 0 && index_content < 0 ){
                                isMatch = false;
                            } else {
                                if (index_content < 0) {
                                    index_content = 0;
                                }
                                if (i == 0) {
                                    first_occur = index_content;
                                }
                            }
                        });
                    }
                    // show search results
                    if (isMatch) {
                        matchcounts += 1;
                        str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                        var content = data.content.trim().replace(/<[^>]+>/g,"");
                        if (first_occur >= 0) {
                            // cut out 100 characters
                            var start = first_occur - 20;
                            var end = first_occur + 80;
                            if(start < 0){
                                start = 0;
                            }
                            if(start == 0){
                                end = 50;
                            }
                            if(end > content.length){
                                end = content.length;
                            }
                            var match_content = content.substring(start, end);
                            // highlight all keywords
                            keywords.forEach(function(keyword){
                                var regS = new RegExp(keyword, "gi");
                                match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                            });
                            
                            str += "<p class=\"search-result\">" + match_content +"...</p>"
                        }
                        str += "</li>";
                    }
                })};
                str += "</ul>";
                if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
                if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
                $resultContent.innerHTML = str;
            });
            proceedsearch();
        }
    });}

    // handle and trigger popup window;
    $('.popup-trigger').mousedown(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };

    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>

  

  

  
  <script src="https://cdn1.lncld.net/static/js/av-core-mini-0.6.1.js"></script>
  <script>AV.initialize("Lsvcc0AtrLqT6Pw3Cr7f8phj-gzGzoHsz", "HvTbRI5ugVcWRpBIMaPXB6XX");</script>
  <script>
    function showTime(Counter) {
      var query = new AV.Query(Counter);
      var entries = [];
      var $visitors = $(".leancloud_visitors");

      $visitors.each(function () {
        entries.push( $(this).attr("id").trim() );
      });

      query.containedIn('url', entries);
      query.find()
        .done(function (results) {
          var COUNT_CONTAINER_REF = '.leancloud-visitors-count';

          if (results.length === 0) {
            $visitors.find(COUNT_CONTAINER_REF).text(0);
            return;
          }

          for (var i = 0; i < results.length; i++) {
            var item = results[i];
            var url = item.get('url');
            var time = item.get('time');
            var element = document.getElementById(url);

            $(element).find(COUNT_CONTAINER_REF).text(time);
          }
          for(var i = 0; i < entries.length; i++) {
            var url = entries[i];
            var element = document.getElementById(url);
            var countSpan = $(element).find(COUNT_CONTAINER_REF);
            if( countSpan.text() == '') {
              countSpan.text(0);
            }
          }
        })
        .fail(function (object, error) {
          console.log("Error: " + error.code + " " + error.message);
        });
    }

    function addCount(Counter) {
      var $visitors = $(".leancloud_visitors");
      var url = $visitors.attr('id').trim();
      var title = $visitors.attr('data-flag-title').trim();
      var query = new AV.Query(Counter);

      query.equalTo("url", url);
      query.find({
        success: function(results) {
          if (results.length > 0) {
            var counter = results[0];
            counter.fetchWhenSave(true);
            counter.increment("time");
            counter.save(null, {
              success: function(counter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(counter.get('time'));
              },
              error: function(counter, error) {
                console.log('Failed to save Visitor num, with error message: ' + error.message);
              }
            });
          } else {
            var newcounter = new Counter();
            /* Set ACL */
            var acl = new AV.ACL();
            acl.setPublicReadAccess(true);
            acl.setPublicWriteAccess(true);
            newcounter.setACL(acl);
            /* End Set ACL */
            newcounter.set("title", title);
            newcounter.set("url", url);
            newcounter.set("time", 1);
            newcounter.save(null, {
              success: function(newcounter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(newcounter.get('time'));
              },
              error: function(newcounter, error) {
                console.log('Failed to create');
              }
            });
          }
        },
        error: function(error) {
          console.log('Error:' + error.code + " " + error.message);
        }
      });
    }

    $(function() {
      var Counter = AV.Object.extend("Counter");
      if ($('.leancloud_visitors').length == 1) {
        addCount(Counter);
      } else if ($('.post-title-link').length > 1) {
        showTime(Counter);
      }
    });
  </script>



  

</body>
</html>
