<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="&amp;#x770B;&amp;#x4E00;&amp;#x770B;&amp;#x81EA;&amp;#x5DF1;&amp;#x5DF2;&amp;#x7ECF;&amp;#x6709;&amp;#x4E24;&amp;#x4E09;&amp;#x4E2A;&amp;#x6708;&amp;#x6CA1;&amp;#x6709;&amp;#x66F4;&amp;#x65B0;&amp;#x535A;&amp;#x5BA2;&amp;#x4E86;&amp;#xFF0C;&amp;#x5176;&amp;#x5B9E;&amp;#x4E00;&amp;#x5F00;&amp;#x59CB;">
<meta property="og:type" content="article">
<meta property="og:title" content="近期Android面试经历总结">
<meta property="og:url" content="https://chacojack.github.io/2017/01/07/Android面试经历总结/index.html">
<meta property="og:site_name" content="ZejianChai's Note">
<meta property="og:description" content="&amp;#x770B;&amp;#x4E00;&amp;#x770B;&amp;#x81EA;&amp;#x5DF1;&amp;#x5DF2;&amp;#x7ECF;&amp;#x6709;&amp;#x4E24;&amp;#x4E09;&amp;#x4E2A;&amp;#x6708;&amp;#x6CA1;&amp;#x6709;&amp;#x66F4;&amp;#x65B0;&amp;#x535A;&amp;#x5BA2;&amp;#x4E86;&amp;#xFF0C;&amp;#x5176;&amp;#x5B9E;&amp;#x4E00;&amp;#x5F00;&amp;#x59CB;">
<meta property="og:updated_time" content="2017-01-07T10:48:08.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="近期Android面试经历总结">
<meta name="twitter:description" content="&amp;#x770B;&amp;#x4E00;&amp;#x770B;&amp;#x81EA;&amp;#x5DF1;&amp;#x5DF2;&amp;#x7ECF;&amp;#x6709;&amp;#x4E24;&amp;#x4E09;&amp;#x4E2A;&amp;#x6708;&amp;#x6CA1;&amp;#x6709;&amp;#x66F4;&amp;#x65B0;&amp;#x535A;&amp;#x5BA2;&amp;#x4E86;&amp;#xFF0C;&amp;#x5176;&amp;#x5B9E;&amp;#x4E00;&amp;#x5F00;&amp;#x59CB;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"hide"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="https://chacojack.github.io/2017/01/07/Android面试经历总结/"/>

  <title> 近期Android面试经历总结 | ZejianChai's Note </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">ZejianChai's Note</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">Android开发者</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-categories">
          <a href="/categories" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-th"></i> <br />
            
            分类
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      

      
        <li class="menu-item menu-item-search">
          
            <a href="#" class="popup-trigger">
          
            
              <i class="menu-item-icon fa fa-search fa-fw"></i> <br />
            
            搜索
          </a>
        </li>
      
    </ul>
  

  
    <div class="site-search">
      
  <div class="popup">
 <span class="search-icon fa fa-search"></span>
 <input type="text" id="local-search-input">
 <div id="local-search-result"></div>
 <span class="popup-btn-close">close</span>
</div>


    </div>
  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                近期Android面试经历总结
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2017-01-07T10:22:02+08:00" content="2017-01-07">
              2017-01-07
            </time>
          </span>

          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2017/01/07/Android面试经历总结/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2017/01/07/Android面试经历总结/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          
             <span id="/2017/01/07/Android面试经历总结/" class="leancloud_visitors" data-flag-title="近期Android面试经历总结">
               &nbsp; | &nbsp;
               <span class="post-meta-item-icon">
                 <i class="fa fa-eye"></i>
               </span>
               <span class="post-meta-item-text">阅读次数 </span>
               <span class="leancloud-visitors-count"></span>
              </span>
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x770B;&#x4E00;&#x770B;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x6709;&#x4E24;&#x4E09;&#x4E2A;&#x6708;&#x6CA1;&#x6709;&#x66F4;&#x65B0;&#x535A;&#x5BA2;&#x4E86;&#xFF0C;&#x5176;&#x5B9E;&#x4E00;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x662F;&#x52A0;&#x73ED;&#x4E25;&#x91CD;&#xFF0C;&#x81EA;&#x5DF1;&#x4E1A;&#x4F59;&#x65F6;&#x95F4;&#x90FD;&#x7528;&#x6765;&#x505A;&#x4E00;&#x4E2A;&#x5C0F;APP&#x4E86;&#x3002;&#x7136;&#x540E;&#x516C;&#x53F8;&#x4F9D;&#x7136;&#x6BCF;&#x51B5;&#x65E5;&#x4E0B;&#xFF0C;&#x5DE5;&#x8D44;&#x62D6;&#x4E86;&#x4E24;&#x4E2A;&#x6708;&#xFF08;&#x6211;&#x771F;&#x7684;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x591F;&#x80FD;&#x575A;&#x6301;&#x7684;&#x4E86;&#xFF01;&#xFF09;&#x3002;&#x4E8E;&#x662F;&#x81EA;&#x5DF1;&#x4E5F;&#x5F00;&#x59CB;&#x52A0;&#x5165;&#x5230;&#x627E;&#x5DE5;&#x4F5C;&#x7684;&#x884C;&#x5217;&#x4E86;&#x3002;&#x9996;&#x5148;&#x81EA;&#x5DF1;&#x662F;&#x5728;&#x67D0;&#x52FE;&#x7F51;&#x6295;&#x7B80;&#x5386;&#x3002;&#x641E;&#x7684;&#x6211;&#x771F;&#x7684;&#x662F;&#x5FEB;&#x6000;&#x7591;&#x4EBA;&#x751F;&#x4E86;&#x3002;&#x6BCF;&#x5929;&#x90FD;&#x6295;&#x4E00;&#x4E9B;&#x516C;&#x53F8;&#xFF0C;&#x4F46;&#x662F;&#x90FD;&#x77F3;&#x6C89;&#x5927;&#x6D77;&#x3002;&#x7136;&#x540E;&#x6211;&#x89C9;&#x5F97;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x7B80;&#x5386;&#x5199;&#x7684;&#x6709;&#x95EE;&#x9898;&#x3002;&#x7136;&#x540E;&#x627E;&#x5404;&#x79CD;&#x670B;&#x53CB;&#x5E2E;&#x5FD9;&#x4FEE;&#x6539;&#xFF0C;&#x7136;&#x540E;&#x53C8;&#x6301;&#x7EED;&#x5728;&#x67D0;&#x52FE;&#x7F51;&#x6295;&#x4E86;&#x4E00;&#x4E2A;&#x661F;&#x671F;&#x3002;&#x7EB3;&#x5C3C;&#xFF1F;&#x7EB3;&#x5C3C;&#xFF1F;&#x7EB3;&#x5C3C;&#xFF1F;&#x96BE;&#x9053;&#x770B;&#x6211;&#x53EA;&#x6709;&#x534A;&#x5E74;&#x5DE5;&#x4F5C;&#x7ECF;&#x9A8C;&#xFF1F;&#x7136;&#x540E;&#x7ED9;&#x670B;&#x53CB;&#x62B1;&#x6028;&#x4E86;&#x4E00;&#x756A;&#x3002;&#x88AB;&#x5B89;&#x5229;&#x53BB;&#x4E86;&#x5176;&#x4ED6;&#x7684;&#x62DB;&#x8058;&#x7F51;&#x7AD9;&#x3002;&#x9762;&#x8BD5;&#x4E5F;&#x7EC8;&#x4E8E;&#x662F;&#x6B65;&#x5165;&#x6B63;&#x8F68;&#xFF01;&#x5C31;&#x8FD9;&#x6837;&#x767D;&#x767D;&#x803D;&#x8BEF;&#x4E86;&#x6211;2&#x4E2A;&#x661F;&#x671F;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x81EA;&#x5DF1;&#x521A;&#x521A;&#x6BD5;&#x4E1A;&#x534A;&#x5E74;&#xFF0C;&#x5176;&#x5B9E;&#x5F88;&#x591A;&#x516C;&#x53F8;&#x90FD;&#x6709;&#x5DE5;&#x4F5C;&#x7ECF;&#x9A8C;&#x9650;&#x5236;&#xFF0C;&#x5927;&#x516C;&#x53F8;&#x7684;&#x8BDD;&#x7B80;&#x5386;&#x786E;&#x5B9E;&#x4E0D;&#x597D;&#x8FC7;&#x3002;&#x4F46;&#x662F;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#x4E0D;&#x600E;&#x4E48;care&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x3002;&#x81EA;&#x5DF1;&#x524D;&#x524D;&#x540E;&#x540E;&#x9762;&#x4E86;5&#xFF0C;6&#x5BB6;&#x516C;&#x53F8;&#x5427;&#x3002;&#x6240;&#x4EE5;&#x8FD8;&#x662F;&#x5EFA;&#x8BAE;&#x5404;&#x4F4D;&#x540C;&#x5B66;&#xFF0C;&#x4E0D;&#x8981;&#x50CF;&#x6211;&#x4E00;&#x6837;&#x6D6A;&#xFF0C;&#x6BD5;&#x4E1A;&#x5C31;&#x8DD1;&#x6765;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#xFF0C;&#x60F3;&#x8981;&#x72EC;&#x5F53;&#x4E00;&#x9762;&#x3002;&#x6211;&#x6765;&#x6361;&#x51E0;&#x5BB6;&#x6211;&#x89C9;&#x5F97;&#x6709;&#x4EE3;&#x8868;&#x6027;&#x6765;&#x8BF4;&#x5427;&#x3002;</p>
<a id="more"></a>
<h2 id="&#x7F51;&#x6613;"><a href="#&#x7F51;&#x6613;" class="headerlink" title="&#x7F51;&#x6613;"></a>&#x7F51;&#x6613;</h2><p>&#x9996;&#x5148;&#x5728;&#x88AB;&#x67D0;&#x52FE;&#x7F51;&#x6574;&#x7684;&#x7CBE;&#x795E;&#x5D29;&#x6E83;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x670B;&#x53CB;&#x5728;&#x7F51;&#x6613;&#x505A;HR&#xFF0C;&#x6240;&#x4EE5;&#x7B80;&#x5386;&#x7ED9;&#x8FC7;&#x4E86;&#xFF08;&#x5176;&#x4ED6;BAT&#x5E94;&#x8BE5;&#x90FD;&#x6CA1;&#x529E;&#x6CD5;&#x8FC7;&#x7B80;&#x5386;&#xFF09;&#x3002;&#x7136;&#x540E;&#x9762;&#x8BD5;&#xFF1A;&#xFF08;BTW&#xFF1A;&#x5230;&#x73B0;&#x5728;&#x4E3A;&#x6B62;&#x6211;&#x89C9;&#x5F97;&#x7F51;&#x6613;&#x7684;&#x9762;&#x8BD5;&#x662F;&#x6BD4;&#x8F83;&#x6709;&#x6C34;&#x5E73;&#x7684;&#xFF0C;&#x95EE;&#x9898;&#x7531;&#x6D45;&#x5165;&#x6DF1;&#xFF0C;&#x6162;&#x6162;&#x89E6;&#x53CA;&#x5230;&#x81EA;&#x5DF1;&#x77E5;&#x8BC6;&#x7684;&#x5E95;&#x7EBF;&#x3002;&#xFF09;</p>
<p>&#x7B2C;&#x4E00;&#x9762;&#x9762;&#x8BD5;&#x7684;&#x5185;&#x5BB9;&#x5927;&#x591A;&#x8FD8;&#x90FD;&#x662F;&#x7B80;&#x5386;&#x4E0A;&#x5199;&#x7684;&#x76F8;&#x5173;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<ol>
<li>&#x81EA;&#x6211;&#x4ECB;&#x7ECD;&#xFF1A;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#xFF0C;&#x8FD8;&#x6709;&#x81EA;&#x5DF1;&#x505A;&#x8FC7;&#x7684;OpenGL&#x89C6;&#x56FE;&#x5E93;&#x548C;&#x9AA8;&#x9ABC;&#x52A8;&#x753B;&#x64AD;&#x653E;&#x5F15;&#x64CE;&#x8BB2;&#x4E86;&#x4E00;&#x4E9B;&#x3002;&#x4F46;&#x662F;&#x9762;&#x8BD5;&#x5B98;&#x5E94;&#x8BE5;&#x662F;&#x4E0D;&#x600E;&#x4E48;&#x719F;&#x6089;&#x8FD9;&#x4E9B;&#x7684;&#x3002;&#x4E0D;&#x8FC7;&#x4E5F;&#x7B97;&#x7A81;&#x51FA;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x7279;&#x70B9;&#x4E86;&#x3002;</li>
<li>&#x7136;&#x540E;&#x5E94;&#x8BE5;&#x662F;&#x60F3;&#x770B;&#x770B;&#x6211;&#x57FA;&#x672C;&#x754C;&#x9762;&#x7F16;&#x8F91;&#x4F1A;&#x4E0D;&#x4F1A;&#xFF0C;&#x7136;&#x540E;&#x95EE;&#x4E86;&#x5E38;&#x7528;&#x7684;&#x5E03;&#x5C40;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5F88;&#x7B80;&#x5355;&#x561B;&#xFF0C;&#x81EA;&#x5DF1;&#x628A;FrameLayout&#xFF0C;LinearLayout&#xFF0C;RelativeLayout&#x8BB2;&#x4E86;&#x4E00;&#x901A;&#xFF0C;&#x7136;&#x540E;&#x53C8;&#x8BB2;&#x4E86;Coordinatorlayout&#x548C;ConstraintLayout&#x3002;</li>
<li>&#x7136;&#x540E;&#x4ED6;&#x95EE;&#x4E86;&#x5F00;&#x53D1;&#x662F;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x5DE5;&#x5177;&#xFF0C;&#x600E;&#x6837;&#x8C03;&#x8BD5;&#x7A0B;&#x5E8F;&#xFF0C;&#x548C;&#x89E3;&#x51B3;bug&#x7684;&#x3002;&#x81EA;&#x5DF1;&#x628A;&#x65E5;&#x5E38;&#x7684;&#x505A;&#x6CD5;&#x8BB2;&#x4E86;&#x4E00;&#x904D;&#x3002;&#x5305;&#x62EC;&#x5404;&#x79CD;&#x65AD;&#x70B9;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x3002;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x7684;&#x68C0;&#x6D4B;&#x65B9;&#x6CD5;&#x3002;&#x5185;&#x5B58;&#x6296;&#x52A8;&#x5982;&#x679C;&#x67E5;&#x627E;&#x5230;&#x539F;&#x56E0;&#x548C;&#x5982;&#x4F55;&#x4F7F;&#x7528;TraceView&#x6765;&#x8FDB;&#x884C;&#x6027;&#x80FD;&#x8C03;&#x4F18;&#x7684;&#x3002;&#x7136;&#x540E;&#x53C8;&#x95EE;&#x4E86;&#x4E00;&#x4E9B;&#x5177;&#x4F53;&#x7684;&#x64CD;&#x4F5C;&#x65B9;&#x6CD5;&#xFF0C;&#x4F30;&#x8BA1;&#x662F;&#x60F3;&#x770B;&#x770B;&#x662F;&#x4E0D;&#x662F;&#x6211;&#x7F16;&#x7684;&#x5427;&#x3002;</li>
<li>&#x7136;&#x540E;&#x5F00;&#x59CB;&#x95EE;&#x67B6;&#x6784;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4E3B;&#x8981;&#x662F;MVC&#x548C;MVP&#xFF0C;&#x5F53;&#x7136;&#x66F4;&#x4E3B;&#x8981;&#x662F;MVP&#x55BD;&#x3002;&#x7136;&#x540E;&#x81EA;&#x5DF1;&#x628A;MVP&#x7684;&#x67B6;&#x6784;&#x8BB2;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x9047;&#x5230;&#x7684;MVP&#x67B6;&#x6784;&#x4E0D;&#x5408;&#x7406;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x548C;&#x81EA;&#x5DF1;&#x8BA4;&#x4E3A;&#x5BF9;&#x8FD9;&#x4E2A;&#x4E0D;&#x5408;&#x7406;&#x5730;&#x65B9;&#x7684;&#x6539;&#x8FDB;&#x3002;&#x7136;&#x540E;&#x8BB2;&#x4E86;&#x81EA;&#x5DF1;&#x9488;&#x5BF9;&#x516C;&#x53F8;&#x9879;&#x76EE;&#x7684;MVP&#x67B6;&#x6784;&#xFF0C;&#x5199;&#x7684;Android Studio&#x63D2;&#x4EF6;&#x3002;</li>
<li>&#x7136;&#x540E;&#x95EE;&#x4E86;&#x6211;&#x7B80;&#x5386;&#x91CC;&#x5199;&#x7684;&#x6280;&#x672F;&#x7EC6;&#x8282;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x6BD4;&#x5982;&#x5C4F;&#x5E55;&#x9002;&#x914D;&#x3002;&#x9879;&#x76EE;&#x4E2D;&#x4E3A;&#x4EC0;&#x4E48;&#x4F7F;&#x7528;OpenGL&#x3002;&#x793C;&#x7269;&#x52A8;&#x753B;&#x4E3A;&#x4EC0;&#x4E48;&#x4F7F;&#x7528;SurfaceView&#xFF0C;&#x5B83;&#x4E0E;View&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x7B49;&#x7B49;&#x3002;</li>
<li>&#x6700;&#x540E;&#x5148;&#x8BA9;&#x6211;&#x8BF4;&#x6211;&#x770B;&#x8FC7;&#x7684;&#x4E00;&#x4E9B;Android&#x7684;&#x6E90;&#x7801;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x8BB2;&#x4E86;&#x4E00;&#x4E0B;Activity&#xFF0C;PhoneWindow&#xFF0C;View&#x4ED6;&#x4EEC;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x8FD8;&#x6709;Touch&#x4E8B;&#x4EF6;&#x7684;&#x5206;&#x53D1;&#x8FC7;&#x7A0B;&#xFF0C;&#x81EA;&#x5DF1;&#x8FD8;&#x8BF4;&#x770B;&#x8FC7;Handler&#x6D88;&#x606F;&#x4F20;&#x9012;&#x673A;&#x5236;&#xFF0C;&#x4E0D;&#x8FC7;&#x4ED6;&#x6CA1;&#x6709;&#x8BA9;&#x53BB;&#x7EC6;&#x8BB2;&#xFF0C;&#x4F30;&#x8BA1;&#x542C;&#x4E86;&#x524D;&#x4E24;&#x4E2A;&#x8BB2;&#x7684;&#x633A;&#x7EC6;&#x7684;&#x89C9;&#x5F97;&#x591F;&#x4E86;&#x5427;&#x3002;&#x7136;&#x540E;&#x4ED6;&#x53C8;&#x95EE;&#x4E86;&#x4E00;&#x4E0B;Activity&#x4ECE;Launcher&#x7684;&#x542F;&#x52A8;&#x8FC7;&#x7A0B;&#x3002;&#x8FD9;&#x4E2A;&#x81EA;&#x5DF1;&#x660E;&#x786E;&#x8868;&#x660E;&#x6CA1;&#x6709;&#x770B;&#x8FC7;&#x6E90;&#x7801;&#xFF0C;&#x4F46;&#x662F;&#x81EA;&#x5DF1;&#x4E5F;&#x7B80;&#x5355;&#x7684;&#x5206;&#x6790;&#x4E86;&#x4E00;&#x4E0B;&#x53EF;&#x80FD;&#x8FC7;&#x7A0B;&#xFF0C;&#x611F;&#x89C9;&#x9762;&#x8BD5;&#x5B98;&#x8FD8;&#x7B97;&#x8BA4;&#x53EF;&#x3002;&#x4E4B;&#x540E;&#x67E5;&#x8BE2;&#x76F8;&#x5173;&#x8D44;&#x6599;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5206;&#x6790;&#x7684;&#x6709;&#x4E9B;&#x5730;&#x65B9;&#x8FD8;&#x662F;&#x4E0D;&#x5BF9;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x7EC6;&#x8282;&#x6CA1;&#x6709;&#x5206;&#x6790;&#x5230;&#xFF08;&#x56E7;&#xFF09;&#x3002;</li>
</ol>
<p>&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x9762;&#x8BD5;&#x4E0B;&#x6765;&#x611F;&#x89C9;&#x8FD8;&#x662F;&#x4E0D;&#x9519;&#x7684;&#x3002;&#x9762;&#x8BD5;&#x5B98;&#x7684;&#x95EE;&#x9898;&#x7531;&#x6D45;&#x5165;&#x6DF1;&#x3002;&#x800C;&#x4E14;&#x9488;&#x5BF9;&#x81EA;&#x5DF1;&#x9879;&#x76EE;&#x7EC6;&#x8282;&#x90FD;&#x6709;&#x9488;&#x5BF9;&#x7684;&#x95EE;&#x9898;&#x3002;&#x9762;&#x8BD5;&#x5230;&#x6700;&#x540E;&#x9762;&#x8BD5;&#x5B98;&#x8BF4;&#x4E4B;&#x540E;&#x4F1A;&#x6709;&#x4E3B;&#x7BA1;&#x7ED9;&#x6211;&#x9762;&#x8BD5;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x4E00;&#x9762;&#x5E94;&#x8BE5;&#x662F;&#x8FC7;&#x4E86;&#x5427;&#x3002;&#x7136;&#x540E;&#x6536;&#x5230;&#x56DE;&#x590D;&#x662F;&#x9762;&#x8BD5;&#x54E5;&#x89C9;&#x5F97;&#x6211;&#x53BB;&#x8FD9;&#x4E2A;&#x90E8;&#x95E8;&#x592A;&#x59D4;&#x5C48;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x662F;&#x6E38;&#x620F;&#x8F85;&#x52A9;APP&#xFF0C;&#x7136;&#x540E;&#x8BA9;HR&#x59D0;&#x59D0;&#x628A;&#x6211;&#x63A8;&#x8350;&#x5230;&#x4E91;&#x97F3;&#x4E50;&#xFF0C;&#x975E;&#x5E38;&#x611F;&#x8C22;&#x9762;&#x8BD5;&#x54E5;&#xFF0C;&#x4EBA;&#x771F;&#x7684;&#x86EE;&#x597D;&#xFF0C;&#x4E5F;&#x8C22;&#x8C22;HR&#x59D0;&#x59D0;&#x5E2E;&#x5FD9;&#x63A8;&#x8350;&#x5176;&#x4ED6;&#x90E8;&#x95E8;&#x3002;&#x4F46;&#x662F;&#x65E0;&#x5948;&#x4E91;&#x97F3;&#x4E50;&#x5E76;&#x4E0D;&#x7F3A;&#x4EBA;&#xFF0C;&#x4F46;&#x8FD9;&#x91CC;&#x4E5F;&#x4E0D;&#x8981;&#x6211;&#x4E86;&#x2026;&#x2026;&#x4E0D;&#x8FC7;&#x5BF9;&#x65B9;&#x62DB;&#x8058;&#x5C97;&#x4F4D;&#x672C;&#x6765;&#x5C31;&#x662F;&#x9AD8;&#x7EA7;&#x5DE5;&#x7A0B;&#x5E08;&#x3002;&#x53EF;&#x80FD;&#x611F;&#x89C9;&#x6211;&#x7ECF;&#x9A8C;&#x8FD8;&#x662F;&#x4E0D;&#x591F;&#x5427;&#x3002;</p>
<h2 id="&#x67D0;&#x8F6F;&#x4EF6;&#x516C;&#x53F8;"><a href="#&#x67D0;&#x8F6F;&#x4EF6;&#x516C;&#x53F8;" class="headerlink" title="&#x67D0;&#x8F6F;&#x4EF6;&#x516C;&#x53F8;"></a>&#x67D0;&#x8F6F;&#x4EF6;&#x516C;&#x53F8;</h2><p>&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x516C;&#x53F8;&#x76F8;&#x5BF9;&#x4E8E;&#x7F51;&#x6613;&#x7684;&#x9762;&#x8BD5;&#x8981;&#x7B80;&#x5355;&#x4E00;&#x4E9B;&#x3002;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x504F;&#x5411;&#x4E8E;&#x89E3;&#x51B3;&#x4ED6;&#x4EEC;&#x9879;&#x76EE;&#x4E2D;&#x9762;&#x4E34;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<ol>
<li>&#x81EA;&#x6211;&#x4ECB;&#x7ECD;&#xFF1A;&#x5F53;&#x7136;&#x8FD9;&#x4E2A;&#x8FD8;&#x662F;&#x90A3;&#x4E9B;&#x5185;&#x5BB9;&#x561B;&#x3002;</li>
<li>&#x4ED6;&#x53C8;&#x95EE;&#x4E86;&#x4E00;&#x4E9B;&#x57FA;&#x7840;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x8FD9;&#x4E2A;&#x6211;&#x4E5F;&#x8BB0;&#x4E0D;&#x5927;&#x6E05;&#x4E86;&#x3002;</li>
<li>&#x7136;&#x540E;&#x53C8;&#x95EE;&#x4E86;MVP&#x67B6;&#x6784;&#x7684;&#x4E1C;&#x897F;&#x3002;</li>
<li>&#x7136;&#x540E;&#x4ED6;&#x5F00;&#x59CB;&#x95EE;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x4ED6;&#x4EEC;&#x9879;&#x76EE;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8BB2;&#x4E86;&#x4E00;&#x4E2A;&#x9700;&#x6C42;&#x201C;&#x8981;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x663E;&#x793A;&#x4E00;&#x4E2A;&#x8868;&#x683C;&#xFF0C;&#x8868;&#x683C;&#x53EF;&#x80FD;100*100&#xFF0C;&#x8981;&#x5728;&#x8FD9;&#x4E9B;&#x8868;&#x683C;&#x91CC;&#x663E;&#x793A;&#x6570;&#x636E;&#xFF0C;&#x624B;&#x673A;&#x5C4F;&#x5E55;&#x4E00;&#x822C;&#x53EA;&#x80FD;&#x663E;&#x793A;4&#x5217;&#xFF0C;&#x8FD9;&#x4E2A;&#x8981;&#x600E;&#x6837;&#x505A;&#x3002;&#x662F;&#x4F7F;&#x7528;View&#x7528;Canvas&#x7ED8;&#x5236;&#x4E0A;&#x53BB;&#xFF0C;&#x8FD8;&#x662F;&#x4F7F;&#x7528;ViewGroup&#x6DFB;&#x52A0;View&#x8FDB;&#x53BB;&#xFF1F;&#x201D;&#x3002;&#x81EA;&#x5DF1;&#x7ED9;&#x51FA;&#x4E86;&#x4F7F;&#x7528;RecyclerView&#x7136;&#x540E;&#x81EA;&#x5B9A;&#x4E49;LayoutManager&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#xFF08;&#x56E0;&#x4E3A;&#x81EA;&#x5DF1;&#x8FD9;&#x6837;&#x505A;&#x8FC7;&#x561B;&#xFF0C;&#x8BE6;&#x60C5;&#x53EF;&#x4EE5;&#x770B;&#x6211;&#x7684;&#x628A;RecyclerView&#x64B8;&#x6210;&#x9A6C;&#x8702;&#x7A9D;&#xFF09;&#x3002;&#x4ED6;&#x542C;&#x4E86;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x6EE1;&#x610F;&#x7684;&#x3002;</li>
<li>&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x662F;&#x624B;&#x673A;&#x548C;&#x5E73;&#x677F;&#x9002;&#x914D;&#x7684;&#x529E;&#x6CD5;&#x3002;&#x8FD9;&#x4E2A;&#x5176;&#x5B9E;&#x5F88;&#x7B80;&#x5355;&#x561B;&#x3002;Android&#x5B98;&#x65B9;&#x6709;&#x5F88;&#x597D;&#x7684;&#x65B9;&#x6848;&#x3002;layout-swxxx+Fragment&#x561B;&#x3002;&#x7136;&#x540E;&#x63A5;&#x7740;&#x95EE;&#x4E86;Fragment&#x4F7F;&#x7528;&#x7684;&#x5177;&#x4F53;&#x65B9;&#x6CD5;&#x90FD;&#x6709;&#x54EA;&#x4E9B;&#x3002;&#x8FD9;&#x4E2A;&#x4E5F;&#x4E0D;&#x96BE;&#x561B;&#x3002;&#x4EC0;&#x4E48;Fragment+FragmentAdapter+ViewPager&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;FragemntManager&#x6765;&#x901A;&#x8FC7;Transaction&#x6765;&#x64CD;&#x4F5C;Fragment&#x7B49;&#x7B49;&#x3002;</li>
<li>&#x6700;&#x540E;&#x95EE;&#x4E86;&#x4E00;&#x4E0B;&#x5DE5;&#x4F5C;&#x6A21;&#x5F0F;&#x3002;&#x4E00;&#x4E2A;&#x9700;&#x6C42;&#x62FF;&#x5230;&#x624B;&#xFF0C;&#x8981;&#x600E;&#x6837;&#x628A;&#x9700;&#x6C42;&#x505A;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x662F;&#x600E;&#x6837;&#x7684;&#xFF1F;&#x8FD9;&#x4E2A;&#x81EA;&#x5DF1;&#x4ECE;&#x9700;&#x6C42;&#x5206;&#x6790;&#x5230;&#x4E0E;&#x5176;&#x4ED6;&#x90E8;&#x95E8;&#x5546;&#x5B9A;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5206;&#x6790;&#x9700;&#x6C42;&#x8981;&#x6CE8;&#x610F;&#x7684;case&#xFF0C;&#x6700;&#x540E;&#x518D;&#x5B9E;&#x9645;&#x7F16;&#x7801;&#xFF0C;&#x90FD;&#x8BB2;&#x4E86;&#x4E00;&#x4E0B;&#x3002;&#x4ED6;&#x4E5F;&#x6BD4;&#x8F83;&#x6EE1;&#x610F;&#x7684;&#x3002;</li>
</ol>
<p>&#x6574;&#x4F53;&#x4E0B;&#x6765;&#xFF0C;&#x8FD9;&#x4E2A;&#x516C;&#x53F8;&#x504F;&#x5411;&#x4E8E;&#x5E94;&#x7528;&#x548C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x80FD;&#x529B;&#x3002;&#x5177;&#x4F53;&#x7684;&#x539F;&#x7406;&#x6CA1;&#x6709;&#x53BB;&#x95EE;&#x592A;&#x591A;&#x3002;&#x8FC7;&#x7684;&#x4E5F;&#x662F;&#x633A;&#x8F7B;&#x677E;&#x7684;&#x3002;&#x4E0D;&#x8FC7;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x65E0;&#x8BBA;&#x662F;&#x5927;&#x516C;&#x53F8;&#x548C;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#xFF0C;&#x5BF9;MVP&#x90FD;&#x5F88;&#x6709;&#x6BD4;&#x8F83;&#x9AD8;&#x7684;&#x8981;&#x6C42;&#x7684;&#x3002;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x7B80;&#x5386;&#x4E2D;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x4E1C;&#x897F;&#x4E00;&#x5B9A;&#x8981;&#x80FD;&#x8BB2;&#x51FA;&#x4E2A;123&#x3002;&#x8FD9;&#x4E2A;&#x5BB6;&#x516C;&#x53F8;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x6CE8;&#x91CD;&#x4EBA;&#x624D;&#x7684;&#x3002;&#x5F00;&#x7684;&#x85AA;&#x6C34;&#x8FD8;&#x662F;&#x4E0D;&#x9519;&#x7684;&#x3002;&#x4F46;&#x662F;&#x6700;&#x540E;&#x6211;&#x804A;&#x4E86;&#x804A;&#x5DE5;&#x4F5C;&#x5185;&#x5BB9;&#xFF0C;&#x81EA;&#x5DF1;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x611F;&#x5174;&#x8DA3;&#x3002;&#x611F;&#x89C9;&#x5BF9;&#x4E8E;&#x81EA;&#x8EAB;&#x7684;&#x6210;&#x957F;&#x5E2E;&#x52A9;&#x4E0D;&#x662F;&#x5F88;&#x5927;&#xFF0C;&#x6240;&#x4EE5;&#x5E76;&#x6CA1;&#x6709;&#x51C6;&#x5907;&#x53BB;&#x3002;</p>
<h2 id="&#x67D0;&#x521B;&#x4E1A;&#x516C;&#x53F8;"><a href="#&#x67D0;&#x521B;&#x4E1A;&#x516C;&#x53F8;" class="headerlink" title="&#x67D0;&#x521B;&#x4E1A;&#x516C;&#x53F8;"></a>&#x67D0;&#x521B;&#x4E1A;&#x516C;&#x53F8;</h2><p>&#x8FD9;&#x5BB6;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#x7684;&#x9762;&#x8BD5;&#x5176;&#x5B9E;&#x53EA;&#x80FD;&#x7B97;&#x662F;&#x7F18;&#x5206;&#x5427;&#x3002;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x4F20;&#x8BF4;&#x4E2D;&#x7684;&#x975E;&#x5E38;&#x9002;&#x5408;&#x5427;&#x3002;&#x4ED6;&#x4EEC;&#x662F;&#x505A;VR&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6BD4;&#x8F83;&#x5173;&#x6CE8;&#x6211;&#x7684;OpenGL&#x6280;&#x80FD;&#xFF08;&#x5176;&#x4ED6;&#x516C;&#x53F8;&#x90FD;&#x5BF9;&#x6211;&#x8FD9;&#x4E00;&#x70B9;&#x4E0D;&#x4EE5;&#x4E3A;&#x7136;&#xFF09;&#x3002;&#x800C;&#x4E14;&#x4ED6;&#x4EEC;&#x4F1A;&#x53BB;&#x505A;&#x5404;&#x79CD;&#x52A8;&#x753B;&#x6548;&#x679C;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x77E5;&#x9053;&#x9AA8;&#x9ABC;&#x52A8;&#x753B;&#x662F;&#x4E2A;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x3002;&#x800C;&#x6211;&#x4ECE;&#x96F6;&#x5F00;&#x53D1;&#x4E86;&#x4E00;&#x4E2A;&#x9AA8;&#x9ABC;&#x52A8;&#x753B;&#x5F15;&#x64CE;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x7684;&#x96BE;&#x5EA6;&#xFF0C;&#x867D;&#x7136;&#x662F;&#x4E2A;2D&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x539F;&#x7406;&#x5927;&#x81F4;&#x76F8;&#x540C;&#xFF0C;&#x81EA;&#x7136;&#x4E5F;&#x662F;&#x5341;&#x5206;&#x9752;&#x7750;&#x3002;&#x800C;&#x4E14;&#x4ED6;&#x4EEC;&#x662F;&#x8981;&#x505A;SDK&#xFF0C;&#x800C;&#x6211;&#x4E5F;&#x6709;&#x5F00;&#x53D1;SDK&#x7684;&#x7ECF;&#x5386;&#x3002;</p>
<p>&#x4E3B;&#x8981;&#x95EE;&#x7684;&#x95EE;&#x9898;&#x90FD;&#x662F;&#x9488;&#x5BF9;&#x4E8E;OpenGL&#x548C;&#x6211;&#x5199;&#x7684;&#x9AA8;&#x9ABC;&#x52A8;&#x753B;&#x5F15;&#x64CE;&#x548C;&#x7EC6;&#x8282;&#xFF0C;&#x8FD8;&#x6709;SDK&#x7684;&#x8BBE;&#x8BA1;&#x8FD9;&#x4E09;&#x65B9;&#x9762;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x9762;&#x8BD5;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E5F;&#x611F;&#x53D7;&#x51FA;&#x4E86;&#x4ED6;&#x4EEC;&#x516C;&#x53F8;&#x6280;&#x672F;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x81EA;&#x5DF1;&#x641E;OpenGL&#x4E8B;&#x4EF6;&#x6BD4;&#x8F83;&#x77ED;&#xFF0C;&#x7406;&#x89E3;&#x8FD8;&#x4E0D;&#x662F;&#x5F88;&#x6DF1;&#xFF0C;&#x9762;&#x8BD5;&#x54E5;&#x4ECE;OpenGL&#x600E;&#x6837;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x548C;GPU&#x600E;&#x6837;&#x5DE5;&#x4F5C;&#x7684;&#x7ED9;&#x6211;&#x8BB2;&#x4E86;&#x4E00;&#x901A;&#x2026;&#x2026;&#x5728;&#x7406;&#x89E3;&#x6DF1;&#x5EA6;&#x4E0A;&#x88AB;&#x5B8C;&#x7206;&#x2026;&#x2026;</p>
<p>&#x4E4B;&#x540E;&#x51E0;&#x8F6E;&#x6280;&#x672F;&#x9762;&#x5DEE;&#x4E0D;&#x591A;&#x540C;&#x6837;&#x5185;&#x5BB9;&#x3002;&#x6700;&#x540E;&#x5C31;&#x662F;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#x7684;&#x5C3F;&#x6027;&#x561B;&#xFF0C;&#x526F;&#x603B;&#x88C1;&#x3001;CEO&#x968F;&#x4FBF;&#x9762;&#x9762;&#x5C31;OK&#x4E86;&#x3002;</p>
<h2 id="&#x5176;&#x4ED6;&#x516C;&#x53F8;"><a href="#&#x5176;&#x4ED6;&#x516C;&#x53F8;" class="headerlink" title="&#x5176;&#x4ED6;&#x516C;&#x53F8;"></a>&#x5176;&#x4ED6;&#x516C;&#x53F8;</h2><p>&#x5176;&#x4ED6;&#x8FD8;&#x6709;&#x51E0;&#x5BB6;&#x516C;&#x53F8;&#x3002;</p>
<ol>
<li>&#x5176;&#x4E2D;&#x4E00;&#x5BB6;&#x503E;&#x5411;&#x4E8E;ROM&#x5F00;&#x53D1;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;Framework&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x95EE;&#x7684;&#x95EE;&#x9898;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x5E94;&#x7528;&#x7684;&#x5F00;&#x53D1;&#x7684;&#x6CA1;&#x6709;&#x53C2;&#x8003;&#x4EF7;&#x503C;&#x3002;&#x7B80;&#x76F4;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#xFF01;</li>
<li>&#x8FD8;&#x6709;&#x51E0;&#x5BB6;&#x5916;&#x5305;&#x516C;&#x53F8;&#xFF0C;&#x90FD;&#x6CA1;&#x6709;&#x6280;&#x672F;&#x9762;&#xFF0C;&#x505A;&#x4E2A;&#x7B14;&#x8BD5;&#x9898;OK&#x4E86;&#x2026;&#x2026;</li>
<li>&#x8FD8;&#x6709;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x6628;&#x5929;&#x9762;&#x8BD5;&#x7684;&#xFF0C;&#x4E0A;&#x6765;&#x95EE;&#x4E86;&#x4E00;&#x4E2A;&#x5145;&#x6EE1;&#x6740;&#x6C14;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x4F60;&#x6700;&#x64C5;&#x957F;&#x4EC0;&#x4E48;&#xFF01;&#x542C;&#x5230;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x7684;&#x7B2C;&#x4E00;&#x53CD;&#x5E94;&#x662F;&#x4E00;&#x8138;&#x61F5;&#x903C;&#xFF01;&#x7B2C;&#x4E8C;&#x53CD;&#x5E94;&#xFF1A;&#x8FD9;&#x662F;&#x8981;&#x603C;&#x6211;&#x4E86;&#xFF01;&#x65E0;&#x8BBA;&#x56DE;&#x7B54;&#x4EC0;&#x4E48;&#x4ED6;&#x90FD;&#x4F1A;&#x5728;&#x8FD9;&#x4E2A;&#x65B9;&#x5411;&#x95EE;&#x5230;&#x6B7B;&#x3002;&#x53EF;&#x80FD;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;API&#xFF0C;&#x8BB0;&#x4E0D;&#x4F4F;&#x90FD;&#x4F1A;&#x8BA9;&#x4ED6;&#x8BA4;&#x4E3A;&#xFF0C;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x7684;&#x4E1C;&#x897F;&#x4F60;&#x90FD;&#x4E0D;&#x4F1A;&#x8FD8;&#x8BF4;&#x64C5;&#x957F;&#xFF1F;&#x800C;&#x5F80;&#x5F80;&#x5C31;&#x662F;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;API&#xFF0C;&#x8C01;&#x4F1A;&#x53BB;&#x80CC;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#x3002;&#x4E0D;&#x8FC7;&#x9047;&#x5230;&#x4E86;&#x6211;&#x4E5F;&#x662F;&#x8BA4;&#x547D;&#x4E86;&#xFF01;&#x7136;&#x540E;&#x6211;&#x5C31;&#x8BF4;&#x4E86;&#x4E2A;UI&#x7ED8;&#x5236;&#x65B9;&#x9762;&#x3002;&#x7136;&#x540E;&#x4ED6;&#x53C8;&#x95EE;&#x4E86;&#x6211;&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x505A;&#x8FC7;&#x7684;&#x6700;&#x590D;&#x6742;&#x7684;&#x4E1C;&#x897F;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x7136;&#x540E;&#x6211;&#x8BB2;&#x4E86;&#x81EA;&#x5DF1;&#x505A;&#x7684;OpenGL&#x89C6;&#x56FE;&#x5E93;&#x548C;&#x9AA8;&#x9ABC;&#x52A8;&#x753B;&#x5F15;&#x64CE;&#x3002;&#x4E0D;&#x8FC7;&#x4ED6;&#x597D;&#x50CF;&#x5E76;&#x4E0D;&#x600E;&#x4E48;&#x5173;&#x5FC3;&#x3002;&#x5E94;&#x8BE5;&#x662F;&#x6CA1;&#x505A;&#x8FC7;OpenGL&#x5427;&#xFF0C;&#x4E5F;&#x6CA1;&#x505A;&#x8FC7;&#x4EC0;&#x4E48;&#x590D;&#x6742;&#x7684;&#x52A8;&#x753B;&#x6548;&#x679C;&#x5427;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x8981;&#x95EE;&#x4EC0;&#x4E48;&#x3002;&#x7136;&#x540E;&#x53C8;&#x95EE;&#x8FD8;&#x505A;&#x8FC7;&#x4EC0;&#x4E48;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x628A;&#x81EA;&#x5DF1;&#x505A;&#x7684;&#x81EA;&#x5B9A;&#x4E49;View&#x8BF4;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x6211;&#x7684;RecyclerView&#x7684;&#x9A6C;&#x8702;&#x7A9D;&#x5E03;&#x5C40;&#x7BA1;&#x7406;&#x5668;&#xFF08;&#x4E00;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x7684;LayoutManager&#xFF09;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x4ED6;&#x6123;&#x662F;&#x628A;&#x6211;&#x8BF4;&#x7684;&#x81EA;&#x5B9A;&#x4E49;LayoutManager&#x7406;&#x89E3;&#x6210;&#x4E86;&#x81EA;&#x5DF1;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x4E00;&#x4E2A;ViewGroup&#xFF01;&#x7136;&#x540E;&#x95EE;&#x7684;&#x95EE;&#x9898;&#x6211;&#x90FD;&#x611F;&#x89C9;&#x4E0D;&#x662F;&#x6211;&#x8FD9;&#x4E2A;LayoutManager&#x6240;&#x80FD;&#x7BA1;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x7136;&#x540E;&#x5F04;&#x4E86;&#x534A;&#x5929;&#x624D;&#x53D1;&#x73B0;&#xFF0C;&#x9762;&#x8BD5;&#x54E5;&#x4E00;&#x76F4;&#x7406;&#x89E3;&#x7684;&#x6709;&#x51FA;&#x5165;&#x2026;&#x2026;&#x771F;&#x662F;&#x56E7;&#xFF01;&#x6574;&#x4E2A;&#x9762;&#x8BD5;&#x8FC7;&#x7A0B;&#x4E0B;&#x6765;&#x611F;&#x89C9;&#x5929;&#x5357;&#x5730;&#x5317;&#x3002;&#x8FD8;&#x6709;&#x4ED6;&#x95EE;&#x6211;&#x7528;&#x7684;OpenGL&#x662F;&#x7528;&#x7684;&#x4EC0;&#x4E48;&#x5BB9;&#x5668;&#xFF1F;&#x6211;&#x8BF4;GLSurfaceView&#x3002;&#x597D;&#x50CF;&#x4ED6;&#x542C;&#x6210;&#x4E86;SurfaceView&#xFF0C;&#x7136;&#x540E;&#x95EE;SurfaceView&#x548C;View&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x3002;&#x4E00;&#x5F00;&#x59CB;&#x8FD9;&#x91CC;&#x662F;&#x6211;&#x6CA1;&#x6709;&#x542C;&#x6E05;&#xFF0C;&#x56E0;&#x4E3A;&#x7D27;&#x63A5;&#x7740;&#x4ED6;&#x95EE;&#x7684;OpenGL&#x5728;&#x4EC0;&#x4E48;&#x5BB9;&#x5668;&#x561B;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x628A;GLSurfaceView&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x8BB2;&#x4E86;&#x534A;&#x5929;&#x2026;&#x2026;&#x9762;&#x8BD5;&#x54E5;&#x542C;&#x7684;&#x597D;&#x50CF;&#x4E5F;&#x662F;&#x4E91;&#x91CC;&#x96FE;&#x91CC;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x77E5;&#x9053;&#xFF0C;&#x4ED6;&#x95EE;&#x7684;SurfaceView&#xFF0C;&#x7136;&#x540E;&#x6211;&#x53C8;&#x628A;SurfaceView&#x7684;&#x8BB2;&#x4E86;&#x4E00;&#x901A;&#x2026;&#x2026;&#x6574;&#x4E2A;&#x9762;&#x8BD5;&#x6211;&#x89C9;&#x5F97;&#x9762;&#x8BD5;&#x54E5;&#x548C;&#x6211;&#x90FD;&#x4E0D;&#x8212;&#x670D;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x89C9;&#x5F97;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x8FC7;&#x5427;&#x3002;</li>
</ol>
<h2 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h2><p>&#x9762;&#x8BD5;&#x4E0B;&#x6765;&#x4E5F;&#x6709;&#x4E9B;&#x611F;&#x609F;&#x5427;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x5728;&#x9762;&#x8BD5;&#x4E2D;&#x5FC5;&#x7136;&#x6D89;&#x53CA;&#x7684;&#x95EE;&#x9898;&#x3002;&#x53EF;&#x80FD;&#x6211;&#x4E0A;&#x9762;&#x5E76;&#x6CA1;&#x6709;&#x5217;&#x70B9;&#x6765;&#x5177;&#x4F53;&#x8BF4;&#x660E;&#xFF0C;&#x4F46;&#x662F;&#x591A;&#x5C11;&#x90FD;&#x6709;&#x6D89;&#x53CA;&#x3002;&#x800C;&#x4E14;&#x6211;&#x5373;&#x4F7F;&#x5217;&#x51FA;&#x4E86;&#x8FD9;&#x4E9B;&#xFF0C;&#x4F60;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x4F1A;&#x9047;&#x5230;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x8303;&#x56F4;&#x592A;&#x5927;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x81EA;&#x5DF1;&#x8981;&#x6CE8;&#x610F;&#x5BF9;&#x4E8E;&#x7EC6;&#x8282;&#x7684;&#x8FFD;&#x6C42;&#x3002;&#x5982;&#x679C;&#x662F;&#x8981;&#x9762;&#x8BD5;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x81EA;&#x5DF1;&#x627E;&#x4E00;&#x4E9B;&#xFF0C;&#x90FD;&#x6709;&#x5F88;&#x591A;&#x7BC7;&#x6587;&#x7AE0;&#x6765;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x70B9;&#x4E86;&#x3002;</p>
<p>&#x5176;&#x6B21;&#x7684;&#x9762;&#x8BD5;&#x5185;&#x5BB9;&#x8981;&#x53D6;&#x51B3;&#x4E8E;&#x9762;&#x8BD5;&#x5B98;&#x4E86;&#xFF0C;&#x6211;&#x611F;&#x89C9;&#x5927;&#x6982;&#x5206;&#x4E3A;&#x4E09;&#x79CD;&#x9762;&#x8BD5;&#x5B98;&#x3002;</p>
<ol>
<li>&#x7B2C;&#x4E00;&#x79CD;&#x662F;&#x90A3;&#x79CD;&#x4F1A;&#x6839;&#x636E;&#x4F60;&#x7684;&#x7B80;&#x5386;&#x6765;&#x9762;&#x8BD5;&#x7684;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x5927;&#x591A;&#x6570;&#x3002;</li>
<li>&#x7B2C;&#x4E8C;&#x79CD;&#x4F1A;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#x6765;&#x9762;&#x8BD5;&#x7684;&#x3002;</li>
<li>&#x7B2C;&#x4E09;&#x79CD;&#xFF0C;&#x6839;&#x636E;&#x4F60;&#x53FC;&#x4E0D;&#x53FC;&#x6765;&#x9762;&#x8BD5;&#x7684;&#x3002;</li>
</ol>
<p>&#x9488;&#x5BF9;&#x4E8E;&#x7B2C;&#x4E00;&#x79CD;&#x6211;&#x89C9;&#x5F97;&#x9996;&#x5148;&#x662F;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x7B80;&#x5386;&#x4E25;&#x683C;&#x628A;&#x5173;&#xFF0C;&#x5199;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x4E00;&#x5B9A;&#x8981;&#x53EF;&#x4EE5;&#x8BF4;&#x51FA;123&#x3002;&#x5BF9;&#x4E8E;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#x8BED;&#x8A00;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#x6BD4;&#x8F83;&#x5DEE;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x3002;&#x6240;&#x4EE5;&#x81EA;&#x5DF1;&#x5728;&#x9762;&#x8BD5;&#x4E4B;&#x524D;&#x5148;&#x8BD5;&#x7740;&#x8BF4;&#x4E00;&#x8BF4;&#xFF0C;&#x56E0;&#x4E3A;&#x9762;&#x8BD5;&#x8FC7;&#x7A0B;&#x4F60;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x8BF4;&#x6765;&#x8BA9;&#x5BF9;&#x65B9;&#x77E5;&#x9053;&#x4F60;&#x6240;&#x505A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F60;&#x80FD;&#x505A;&#x51FA;&#x6765;&#x7684;&#x4E00;&#x5B9A;&#x8981;&#x80FD;&#x8BF4;&#x51FA;&#x6765;&#x3002;&#x636E;&#x8BF4;&#x6709;&#x4E9B;&#x4EBA;&#x6CA1;&#x505A;&#x8FC7;&#x4E5F;&#x80FD;&#x8BF4;&#x51FA;&#x6765;&#x3002;&#x4E0D;&#x8FC7;&#x6211;&#x662F;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x9488;&#x5BF9;&#x4E8E;&#x7B2C;&#x4E8C;&#x79CD;&#x5176;&#x5B9E;&#x8981;&#x770B;&#x81EA;&#x5DF1;&#x7684;&#x5E94;&#x53D8;&#x80FD;&#x529B;&#x3002;&#x56E0;&#x4E3A;&#x4F60;&#x5F88;&#x96BE;&#x9884;&#x6D4B;&#x5230;&#x5BF9;&#x65B9;&#x53EF;&#x80FD;&#x4F1A;&#x7ED9;&#x4F60;&#x63D0;&#x51FA;&#x600E;&#x6837;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6709;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x4E00;&#x542C;&#x5230;&#x95EE;&#x9898;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x9A6C;&#x4E0A;&#x60F3;&#x5230;&#x89E3;&#x51B3;&#x7684;&#x529E;&#x6CD5;&#x3002;&#x90A3;&#x4E48;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x5C0F;&#x6280;&#x5DE7;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BF4;&#x6CA1;&#x6709;&#x542C;&#x6E05;&#x695A;&#xFF0C;&#x4E2D;&#x95F4;&#x6709;&#x4E00;&#x70B9;&#x4FE1;&#x53F7;&#x4E0D;&#x597D;&#xFF0C;&#x8BA9;&#x9762;&#x8BD5;&#x5B98;&#x91CD;&#x590D;&#x4E00;&#x904D;&#x95EE;&#x9898;&#xFF0C;&#x6765;&#x4E3A;&#x81EA;&#x5DF1;&#x4E89;&#x53D6;&#x601D;&#x8003;&#x65F6;&#x95F4;&#x3002;&#x5982;&#x679C;&#x8FD8;&#x6CA1;&#x6709;&#x60F3;&#x51FA;&#x6765;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x5148;&#x5206;&#x6790;&#x63D0;&#x51FA;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x6E10;&#x6E10;&#x63A5;&#x8FD1;&#x95EE;&#x9898;&#x7684;&#x7B54;&#x6848;&#x3002;</p>
<p>&#x9488;&#x5BF9;&#x4E8E;&#x7B2C;&#x4E09;&#x79CD;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x4E4B;&#x524D;&#x4E5F;&#x6CA1;&#x6709;&#x51C6;&#x5907;&#x8FC7;&#x3002;&#x7B2C;&#x4E09;&#x79CD;&#x9762;&#x8BD5;&#x5B98;&#x975E;&#x5E38;&#x559C;&#x6B22;&#x95EE;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF1A;&#x4F60;&#x64C5;&#x957F;&#x4EC0;&#x4E48;&#xFF1F;&#x4F60;&#x5728;&#x54EA;&#x65B9;&#x9762;&#x6709;&#x8FC7;&#x4EBA;&#x4E4B;&#x5904;&#xFF1F;&#x4F60;&#x5BF9;&#x54EA;&#x65B9;&#x9762;&#x6BD4;&#x8F83;&#x7CBE;&#x901A;&#xFF1F;&#x5176;&#x5B9E;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x9762;&#x8BD5;&#x5B98;&#x5C31;&#x5FC3;&#x4E2D;&#x9ED8;&#x5FF5;&#x963F;&#x5F25;&#x9640;&#x4F5B;&#x5427;&#xFF01;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x9762;&#x8BD5;&#x5B98;&#x8981;&#x6C42;&#x975E;&#x5E38;&#x9AD8;&#x3002;&#x4ED6;&#x5E0C;&#x671B;&#x7684;&#x662F;&#x4F60;&#x5BF9;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x7814;&#x7A76;&#x7684;&#x975E;&#x5E38;&#x6DF1;&#x5165;&#xFF0C;&#x4F60;&#x4E00;&#x4E2A;&#x4EBA;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x6240;&#x6709;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E14;&#x5E0C;&#x671B;&#x4F60;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x505A;&#x51FA;&#x8FC7;&#x4E00;&#x5B9A;&#x7A81;&#x7834;&#x3002;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x5E38;&#x7528;&#x7684;&#x4EC0;&#x4E48;&#x52A0;&#x8F7D;&#x5E93;&#xFF0C;&#x4F60;&#x4F18;&#x5316;&#x5B83;&#xFF0C;&#x7ED3;&#x679C;&#x5FEB;&#x4E86;&#x591A;&#x5C11;&#xFF0C;&#x5C31;&#x662F;1%&#x90FD;&#x53EF;&#x4EE5;&#x3002;&#x8FD9;&#x4E2A;&#x53EF;&#x4E0D;&#x662F;&#x4E00;&#x822C;&#x7684;&#x4EBA;&#x80FD;&#x591F;&#x8FBE;&#x5230;&#x7684;&#x3002;&#x800C;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x5404;&#x4E2A;&#x9886;&#x57DF;&#x90FD;&#x6D89;&#x53CA;&#x4E00;&#x70B9;&#xFF0C;&#x867D;&#x7136;&#x53EF;&#x80FD;&#x770B;&#x8FC7;&#x6E90;&#x7801;&#xFF0C;&#x6709;&#x4E00;&#x5B9A;&#x7406;&#x89E3;&#x7684;&#x6DF1;&#x5EA6;&#xFF0C;&#x4F46;&#x8FDC;&#x8FBE;&#x4E0D;&#x5230;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x6240;&#x6709;&#x95EE;&#x9898;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x66F4;&#x6CA1;&#x6709;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x7A81;&#x7834;&#x3002;&#x50CF;&#x6709;&#x4E9B;&#x7B2C;&#x4E09;&#x65B9;&#x5E93;&#x6E90;&#x7801;&#x6211;&#x4E5F;&#x53BB;&#x770B;&#x8FC7;&#xFF0C;&#x4F46;&#x81EA;&#x8BA4;&#x4E3A;&#x8FBE;&#x4E0D;&#x5230;&#x4ED6;&#x4EEC;&#x6240;&#x8C13;&#x7684;&#x64C5;&#x957F;&#x548C;&#x7CBE;&#x901A;&#x3002;&#x4E0D;&#x8FC7;&#x9488;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x9762;&#x8BD5;&#x5B98;&#x6211;&#x89C9;&#x5F97;&#x4E5F;&#x662F;&#x503C;&#x5F97;&#x51C6;&#x5907;&#x4E00;&#x4E0B;&#x7684;&#x3002;&#x4E0D;&#x7136;&#x81EA;&#x5DF1;&#x771F;&#x7684;&#x662F;&#x4F1A;&#x4E00;&#x8138;&#x61F5;&#x903C;&#x3002;&#x6709;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x662F;&#x9047;&#x5230;&#x8FD9;&#x6837;&#x8303;&#x8303;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x5C31;&#x5DF2;&#x7ECF;&#x4E0D;&#x77E5;&#x9053;&#x8981;&#x5982;&#x4F55;&#x8BF4;&#x8BDD;&#x4E86;&#x3002;&#x7136;&#x540E;&#x8BF4;&#x9519;&#x4E00;&#x53E5;&#x8BDD;&#x5C31;&#x4F1A;&#x88AB;&#x5404;&#x79CD;&#x5B8C;&#x7206;&#xFF0C;&#x8111;&#x6D77;&#x4E2D;&#x56DE;&#x54CD;&#x5404;&#x79CD; Enemy is Legendary&#xFF01;&#x4E4B;&#x540E;&#x51E0;&#x5929;&#x4F30;&#x8BA1;&#x90FD;&#x8981;&#x6000;&#x7591;&#x4EBA;&#x751F;&#x4E86;&#x2026;&#x2026;&#x90A3;&#x4E48;&#x4E0B;&#x9762;&#x8BF4;&#x4E00;&#x4E0B;&#x51C6;&#x5907;&#x65B9;&#x6CD5;&#x5427;&#x3002;&#x4E0D;&#x8FC7;&#x81EA;&#x5DF1;&#x4E5F;&#x662F;&#x521A;&#x521A;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x9762;&#x8BD5;&#x5B98;&#x3002;&#x4E5F;&#x6CA1;&#x6709;&#x786E;&#x5B9A;&#x662F;&#x5426;&#x6B63;&#x786E;&#x3002;&#x4E5F;&#x662F;&#x7ED9;&#x81EA;&#x5DF1;&#x7684;&#x8BA1;&#x5212;&#x3002;</p>
<ol>
<li>&#x9009;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x64C5;&#x957F;&#x7684;&#x9886;&#x57DF;&#x3002;</li>
<li>&#x57FA;&#x7840;&#x8981; &#x80CC;&#xFF01;&#x5E73;&#x65F6;&#x6211;&#x5E76;&#x4E0D;&#x592A;&#x53BB;&#x7559;&#x610F;&#x8981;&#x8BB0;&#x4F4F;&#x5404;&#x79CD;API&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x5C31;&#x662F;&#x8981;&#x80CC;&#x8FC7;&#x3002;&#x4E0D;&#x7136;&#x9762;&#x8BD5;&#x5B98;&#x5C31;&#x4F1A;&#x60F3;&#x201C;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x7684;API&#x90FD;&#x542B;&#x7CCA;&#x4E0D;&#x6E05;&#x8FD8;&#x8BF4;&#x64C5;&#x957F;&#xFF1F;&#x201D;&#x5C31;&#x662F;&#x771F;&#x7684;&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x8BB0;&#x4E0D;&#x6E05;&#x4E86;&#xFF0C;&#x4E5F;&#x4E0D;&#x8981;&#x6253;&#x78D5;&#xFF0C;&#x8981;&#x975E;&#x5E38;&#x81EA;&#x4FE1;&#x7684;&#x8BF4;&#x4E2A;&#x5DEE;&#x4E0D;&#x591A;&#x7684;&#xFF0C;&#x4E0D;&#x8981;&#x8BF4;&#x201C;&#x597D;&#x50CF;&#x2026;&#x2026;&#x201D;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x3002;&#x8981;&#x7684;&#x5C31;&#x662F;&#x81EA;&#x4FE1;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;API&#x9762;&#x8BD5;&#x5B98;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x8BB0;&#x5F97;&#x90A3;&#x4E48;&#x6E05;&#x695A;&#x3002;&#x4E0D;&#x8FC7;&#x81EA;&#x5DF1;&#x80FD;&#x80CC;&#x8FC7;&#x624D;&#x771F;&#x7684;&#x6709;&#x5E95;&#x6C14;&#x3002;</li>
<li>&#x8BD5;&#x7740;&#x53BB;&#x4E86;&#x89E3;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x5E02;&#x9762;&#x4E0A;&#x7684;&#x6280;&#x672F;&#x3002;&#x4E00;&#x822C;&#x7684;&#x8BDD;&#x5C31;&#x662F;&#x4E00;&#x4E9B;&#x5E93;&#x6216;&#x8005;&#x6846;&#x67B6;&#x3002;&#x8FD9;&#x91CC;&#x8981;&#x8BB0;&#x4F4F;&#xFF0C;&#x4E0D;&#x8981;&#x6025;&#x7740;&#x53BB;&#x770B;&#x6E90;&#x7801;&#xFF0C;&#x8981;&#x5148;&#x638C;&#x63E1;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x90FD;&#x6709;&#x54EA;&#x4E9B;&#x4F18;&#x7F3A;&#x70B9;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x7F3A;&#x70B9;&#xFF01;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x5E93;&#x6709;&#x4EC0;&#x4E48;&#x4F18;&#x70B9;&#x800C;&#x53BB;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x4F46;&#x662F;&#x7F3A;&#x70B9;&#x5F80;&#x5F80;&#x662F;&#x6211;&#x4EEC;&#x5BB9;&#x6613;&#x5FFD;&#x7565;&#x7684;&#x5730;&#x65B9;&#x3002;&#x800C;&#x77E5;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x5E93;&#x7684;&#x7F3A;&#x70B9;&#xFF0C;&#x662F;&#x4F60;&#x80FD;&#x4E0D;&#x80FD;&#x9A7E;&#x9A6D;&#x8FD9;&#x4E2A;&#x5E93;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x3002;</li>
<li>&#x5982;&#x679C;&#x6709;&#x65F6;&#x95F4;&#x7684;&#x8BDD;&#xFF0C;&#x7814;&#x7A76;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x4F17;&#x6240;&#x5468;&#x77E5;&#x7684;&#x5E93;&#x7684;&#x6E90;&#x7801;&#x3002;&#x5E76;&#x8BD5;&#x56FE;&#x627E;&#x5230;&#x5B83;&#x7F3A;&#x70B9;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x5E76;&#x627E;&#x5230;&#x5176;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x3002;&#x5F53;&#x7136;&#x4F60;&#x5982;&#x679C;&#x6B63;&#x8981;&#x51C6;&#x5907;&#x9762;&#x8BD5;&#x4E86;&#xFF0C;&#x80AF;&#x5B9A;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x3002;&#x90A3;&#x4E48;&#x5C31;&#x627E;&#x4E00;&#x4E9B;&#x73B0;&#x6210;&#x7684;&#x76F8;&#x5173;&#x7684;&#x6587;&#x7AE0;&#x6765;&#x770B;&#x770B;&#x5427;&#x3002;&#x7136;&#x540E;&#x8BB0;&#x4F4F;&#x3002;</li>
</ol>
<h2 id="&#x7ED3;&#x679C;"><a href="#&#x7ED3;&#x679C;" class="headerlink" title="&#x7ED3;&#x679C;"></a>&#x7ED3;&#x679C;</h2><p>&#x8FD1;&#x671F;&#x7684;&#x9762;&#x8BD5;&#x8FC7;&#x7A0B;&#x5C31;&#x662F;&#x5DEE;&#x4E0D;&#x591A;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#x3002;&#x800C;&#x4E14;&#x5BF9;&#x4E8E;&#x6211;&#x8FD9;&#x79CD;&#x521A;&#x521A;&#x6BD5;&#x4E1A;&#x534A;&#x5E74;&#xFF0C;&#x5F88;&#x591A;&#x516C;&#x53F8;&#x8FDE;&#x7B80;&#x5386;&#x90FD;&#x6BD4;&#x8F83;&#x96BE;&#x8FC7;&#x3002;&#x6240;&#x4EE5;&#x4E5F;&#x6CA1;&#x6709;&#x4E00;&#x4E9B;&#x975E;&#x5E38;&#x5927;&#x7684;&#x516C;&#x53F8;&#x7684;&#x9762;&#x8BD5;&#x673A;&#x4F1A;&#x3002;&#x56E0;&#x4E3A;&#x5927;&#x516C;&#x53F8;&#x793E;&#x62DB;&#x548C;&#x6821;&#x62DB;&#x5206;&#x7684;&#x5F88;&#x6E05;&#x695A;&#x3002;&#x6700;&#x7EC8;&#x81EA;&#x5DF1;&#x51B3;&#x5B9A;&#x53BB;&#x90A3;&#x5BB6;VR&#x7684;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#x4E86;&#xFF0C;&#x539F;&#x56E0;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;&#xFF1A;&#x6211;&#x672C;&#x653E;&#x8361;&#x4E0D;&#x7F81;&#x7231;&#x81EA;&#x7531;&#xFF0C;&#x7B2C;&#x4E00;&#x5F53;&#x7136;&#x662F;&#x5174;&#x8DA3;&#xFF0C;&#x7B2C;&#x4E8C;&#x5462;&#x5E0C;&#x671B;&#x8865;&#x5145;Android&#x65B9;&#x9762;NDK&#x7684;&#x6280;&#x672F;&#xFF0C;&#x7B2C;&#x4E09;&#x5E0C;&#x671B;&#x53EF;&#x4EE5;&#x505A;&#x4E00;&#x4E9B;OpenGL&#x9886;&#x57DF;&#x66F4;&#x6DF1;&#x5165;&#x7814;&#x7A76;&#xFF0C;&#x800C;VR&#x6B63;&#x662F;&#x5BF9;&#x5176;&#x8981;&#x6C42;&#x975E;&#x5E38;&#x9AD8;&#xFF0C;&#x81EA;&#x5DF1;&#x4E5F;&#x60F3;&#x53BB;&#x6311;&#x6218;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x6280;&#x672F;&#x74F6;&#x9888;&#x3002;&#x4E0B;&#x6B21;&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x6709;&#x5E95;&#x6C14;&#x7684;&#x56DE;&#x7B54;&#x6700;&#x64C5;&#x957F;&#x4EC0;&#x4E48;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x6700;&#x540E;&#x6211;&#x5BA3;&#x5E03;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6B63;&#x5F0F;&#x56DE;&#x5F52;&#x535A;&#x5BA2;&#x65E5;&#x5E38;&#x66F4;&#x65B0;&#xFF01;</p>

      
    </div>

    <div>
      
        
      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/10/15/矢量太阳系-Android矢量动画/" rel="next" title="把太阳系撸成会动的矢量图">
                <i class="fa fa-chevron-left"></i> 把太阳系撸成会动的矢量图
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/01/08/Android面试知识点总结/" rel="prev" title="Android面试知识点总结">
                Android面试知识点总结 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2017/01/07/Android面试经历总结/"
           data-title="近期Android面试经历总结" data-url="https://chacojack.github.io/2017/01/07/Android面试经历总结/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.png"
               alt="柴泽建" />
          <p class="site-author-name" itemprop="name">柴泽建</p>
          <p class="site-description motion-element" itemprop="description">对代码永不满足</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">24</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              <a href="/categories">
                <span class="site-state-item-count">3</span>
                <span class="site-state-item-name">分类</span>
              </a>
            </div>
          

          
            <div class="site-state-item site-state-tags">
              
                <span class="site-state-item-count">1</span>
                <span class="site-state-item-name">标签</span>
              
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/Chacojack" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/2703310877" target="_blank" title="Weibo">
                  
                    <i class="fa fa-fw fa-weibo"></i>
                  
                  Weibo
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.jianshu.com/users/dd5f6394457d/latest_articles" target="_blank" title="Jianshu">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  Jianshu
                </a>
              </span>
            
          
        </div>

        
        

        
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#网易"><span class="nav-number">1.</span> <span class="nav-text">网易</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#某软件公司"><span class="nav-number">2.</span> <span class="nav-text">某软件公司</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#某创业公司"><span class="nav-number">3.</span> <span class="nav-text">某创业公司</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#其他公司"><span class="nav-number">4.</span> <span class="nav-text">其他公司</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#总结"><span class="nav-number">5.</span> <span class="nav-text">总结</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#结果"><span class="nav-number">6.</span> <span class="nav-text">结果</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">柴泽建</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Mist
  </a>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"jack-chai-notes"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
  






  
  
  <script type="text/javascript">
    // Popup Window;
    var isfetched = false;
    // Search DB path;
    var search_path = "search.xml";
    if (search_path.length == 0) {
       search_path = "search.xml";
    }
    var path = "/" + search_path;
    // monitor main search box;

    function proceedsearch() {
      $("body").append('<div class="popoverlay">').css('overflow', 'hidden');
      $('.popup').toggle();

    }
    // search function;
    var searchFunc = function(path, search_id, content_id) {
    'use strict';
    $.ajax({
        url: path,
        dataType: "xml",
        async: true,
        success: function( xmlResponse ) {
            // get the contents from search data
            isfetched = true;
            $('.popup').detach().appendTo('.header-inner');
            var datas = $( "entry", xmlResponse ).map(function() {
                return {
                    title: $( "title", this ).text(),
                    content: $("content",this).text(),
                    url: $( "url" , this).text()
                };
            }).get();
            var $input = document.getElementById(search_id);
            var $resultContent = document.getElementById(content_id);
            $input.addEventListener('input', function(){
                var matchcounts = 0;
                var str='<ul class=\"search-result-list\">';                
                var keywords = this.value.trim().toLowerCase().split(/[\s\-]+/);
                $resultContent.innerHTML = "";
                if (this.value.trim().length > 1) {
                // perform local searching
                datas.forEach(function(data) {
                    var isMatch = true;
                    var content_index = [];
                    var data_title = data.title.trim().toLowerCase();
                    var data_content = data.content.trim().replace(/<[^>]+>/g,"").toLowerCase();
                    var data_url = data.url;
                    var index_title = -1;
                    var index_content = -1;
                    var first_occur = -1;
                    // only match artiles with not empty titles and contents
                    if(data_title != '' && data_content != '') {
                        keywords.forEach(function(keyword, i) {
                            index_title = data_title.indexOf(keyword);
                            index_content = data_content.indexOf(keyword);
                            if( index_title < 0 && index_content < 0 ){
                                isMatch = false;
                            } else {
                                if (index_content < 0) {
                                    index_content = 0;
                                }
                                if (i == 0) {
                                    first_occur = index_content;
                                }
                            }
                        });
                    }
                    // show search results
                    if (isMatch) {
                        matchcounts += 1;
                        str += "<li><a href='"+ data_url +"' class='search-result-title'>"+ data_title +"</a>";
                        var content = data.content.trim().replace(/<[^>]+>/g,"");
                        if (first_occur >= 0) {
                            // cut out 100 characters
                            var start = first_occur - 20;
                            var end = first_occur + 80;
                            if(start < 0){
                                start = 0;
                            }
                            if(start == 0){
                                end = 50;
                            }
                            if(end > content.length){
                                end = content.length;
                            }
                            var match_content = content.substring(start, end);
                            // highlight all keywords
                            keywords.forEach(function(keyword){
                                var regS = new RegExp(keyword, "gi");
                                match_content = match_content.replace(regS, "<b class=\"search-keyword\">"+keyword+"</b>");
                            });
                            
                            str += "<p class=\"search-result\">" + match_content +"...</p>"
                        }
                        str += "</li>";
                    }
                })};
                str += "</ul>";
                if (matchcounts == 0) { str = '<div id="no-result"><i class="fa fa-frown-o fa-5x" /></div>' }
                if (keywords == "") { str = '<div id="no-result"><i class="fa fa-search fa-5x" /></div>' }
                $resultContent.innerHTML = str;
            });
            proceedsearch();
        }
    });}

    // handle and trigger popup window;
    $('.popup-trigger').mousedown(function(e) {
      e.stopPropagation();
      if (isfetched == false) {
        searchFunc(path, 'local-search-input', 'local-search-result');
      } else {
        proceedsearch();
      };

    });

    $('.popup-btn-close').click(function(e){
      $('.popup').hide();
      $(".popoverlay").remove();
      $('body').css('overflow', '');
    });
    $('.popup').click(function(e){
      e.stopPropagation();
    });
  </script>

  

  

  
  <script src="https://cdn1.lncld.net/static/js/av-core-mini-0.6.1.js"></script>
  <script>AV.initialize("Lsvcc0AtrLqT6Pw3Cr7f8phj-gzGzoHsz", "HvTbRI5ugVcWRpBIMaPXB6XX");</script>
  <script>
    function showTime(Counter) {
      var query = new AV.Query(Counter);
      var entries = [];
      var $visitors = $(".leancloud_visitors");

      $visitors.each(function () {
        entries.push( $(this).attr("id").trim() );
      });

      query.containedIn('url', entries);
      query.find()
        .done(function (results) {
          var COUNT_CONTAINER_REF = '.leancloud-visitors-count';

          if (results.length === 0) {
            $visitors.find(COUNT_CONTAINER_REF).text(0);
            return;
          }

          for (var i = 0; i < results.length; i++) {
            var item = results[i];
            var url = item.get('url');
            var time = item.get('time');
            var element = document.getElementById(url);

            $(element).find(COUNT_CONTAINER_REF).text(time);
          }
          for(var i = 0; i < entries.length; i++) {
            var url = entries[i];
            var element = document.getElementById(url);
            var countSpan = $(element).find(COUNT_CONTAINER_REF);
            if( countSpan.text() == '') {
              countSpan.text(0);
            }
          }
        })
        .fail(function (object, error) {
          console.log("Error: " + error.code + " " + error.message);
        });
    }

    function addCount(Counter) {
      var $visitors = $(".leancloud_visitors");
      var url = $visitors.attr('id').trim();
      var title = $visitors.attr('data-flag-title').trim();
      var query = new AV.Query(Counter);

      query.equalTo("url", url);
      query.find({
        success: function(results) {
          if (results.length > 0) {
            var counter = results[0];
            counter.fetchWhenSave(true);
            counter.increment("time");
            counter.save(null, {
              success: function(counter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(counter.get('time'));
              },
              error: function(counter, error) {
                console.log('Failed to save Visitor num, with error message: ' + error.message);
              }
            });
          } else {
            var newcounter = new Counter();
            /* Set ACL */
            var acl = new AV.ACL();
            acl.setPublicReadAccess(true);
            acl.setPublicWriteAccess(true);
            newcounter.setACL(acl);
            /* End Set ACL */
            newcounter.set("title", title);
            newcounter.set("url", url);
            newcounter.set("time", 1);
            newcounter.save(null, {
              success: function(newcounter) {
                var $element = $(document.getElementById(url));
                $element.find('.leancloud-visitors-count').text(newcounter.get('time'));
              },
              error: function(newcounter, error) {
                console.log('Failed to create');
              }
            });
          }
        },
        error: function(error) {
          console.log('Error:' + error.code + " " + error.message);
        }
      });
    }

    $(function() {
      var Counter = AV.Object.extend("Counter");
      if ($('.leancloud_visitors').length == 1) {
        addCount(Counter);
      } else if ($('.post-title-link').length > 1) {
        showTime(Counter);
      }
    });
  </script>



  

</body>
</html>
